<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN">
<HTML
><HEAD
><TITLE
>Cygwin Utilities</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.73
"><LINK
REL="HOME"
TITLE="Cygwin User's Guide"
HREF="cygwin-ug-net.html"><LINK
REL="UP"
TITLE="Using Cygwin"
HREF="using.html"><LINK
REL="PREVIOUS"
TITLE="The CYGWIN environment
variable"
HREF="using-cygwinenv.html"><LINK
REL="NEXT"
TITLE="Programming with Cygwin"
HREF="programming.html"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Cygwin User's Guide</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="using-cygwinenv.html"
ACCESSKEY="P"
>&#60;&#60;&#60; Previous</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Using Cygwin</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="programming.html"
ACCESSKEY="N"
>Next &#62;&#62;&#62;</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="USING-UTILS"
>Cygwin Utilities</A
></H1
><P
>Cygwin comes with a number of command-line utilities that are
used to manage the UNIX emulation portion of the Cygwin environment.
While many of these reflect their UNIX counterparts, each was written
specifically for Cygwin.</P
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="CYGCHECK"
>cygcheck</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: cygcheck [-s] [-v] [-r] [-h] [program ...]
  -c = check current package setup
  -s = system information
  -v = verbose output (indented) (for -s or programs)
  -r = registry search (requires -s)
  -h = give help about the info
You must at least give either -s or a program name</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>cygcheck</B
> program is a diagnostic utility
that examines your system and reports the information that is
significant to the proper operation of Cygwin programs.  It can give
information about a specific program (or program) you are trying to
run, general system information, or both.  If you list one or more
programs on the command line, it will diagnose the runtime environment
of that program or programs.  If you specify the <TT
CLASS="LITERAL"
>-s</TT
>
option, it will give general system information.  If you specify
<TT
CLASS="LITERAL"
>-s</TT
> and list one or more programs on the command line,
it reports on both.</P
><P
>The <TT
CLASS="LITERAL"
>-c</TT
> option causes the "program" arguments
to be interpreted as package names.  <B
CLASS="COMMAND"
>cygcheck</B
> will
report the current version of the package that you specify.  With no
arguments, <B
CLASS="COMMAND"
>cygcheck</B
> will report on all packages.

<P
>The <B
CLASS="COMMAND"
>cygcheck</B
> program should be used to send
information about your system to Cygnus for troubleshooting (if your
support representative requests it).  When asked to run this command,
include all the options plus any commands you are having trouble with,
and save the output so that you can mail it to Cygnus, like
this:</P
>

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>C:\Cygnus&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>cygcheck -s -v -r -h &#62; tocygnus.txt</B
></TT
></PRE
></TD
></TR
></TABLE
>

<P
>The <TT
CLASS="LITERAL"
>-v</TT
> option causes the output to be more
verbose.  What this means is that additional information will be
reported which is usually not interesting, such as the internal
version numbers of DLLs, additional information about recursive DLL
usage, and if a file in one directory in the PATH also occurs in other
directories on the PATH.  </P
>

<P
>The <TT
CLASS="LITERAL"
>-r</TT
> option causes
<B
CLASS="COMMAND"
>cygcheck</B
> to search your registry for information
that is relevent to Cygnus programs.  These registry entries are the
ones that have "Cygnus" in the name.  If you are paranoid about
privacy, you may remove information from this report, but please keep
in mind that doing so makes it harder for Cygnus to diagnose your
problems.</P
>

<P
>The <TT
CLASS="LITERAL"
>-h</TT
> option prints additional helpful
messages in the report, at the beginning of each section.  It also
adds table column headings.  While this is useful information, it also
adds some to the size of the report, so if you want a compact report
or if you know what everything is already, just leave this out.</P
>&#13;</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="CYGPATH"
>cygpath</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: cygpath [-p|--path] (-u|--unix)|(-w|--windows [-s|--short-name]) filename
       cygpath [-v|--version]
       cygpath [-W|--windir|-S|--sysdir]
  -u|--unix       print UNIX form of filename
  -w|--windows    print Windows form of filename
  -s|--short-name print Windows short form of filename
  -p|--path       filename argument is a path
  -v|--version    print program version
  -W|--windir     print Windows directory
  -S|--sysdir     print Windows system directory
  -i|--ignore     ignore missing filename argument</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>cygpath</B
> program is a utility that
converts Windows native filenames to Cygwin POSIX-style pathnames and
back.  It can be used when a Cygwin program needs to pass a file name
to a native Windows program, or expects to get a file name from a
native Windows program.  You may use the long or short option names
interchangeably, even though only the short ones are described
here.</P
><P
>The <TT
CLASS="LITERAL"
>-u</TT
> and <TT
CLASS="LITERAL"
>-w</TT
> options
indicate whether you want a conversion from Windows to UNIX (POSIX)
format (<TT
CLASS="LITERAL"
>-u</TT
>) or a conversion from UNIX (POSIX) to
Windows format (<TT
CLASS="LITERAL"
>-w</TT
>).  You must give exactly
one of these.  To give neither or both is an error.  Use the
<TT
CLASS="LITERAL"
>-s</TT
> option in combination with the <TT
CLASS="LITERAL"
>-w</TT
> option to convert to Windows short form.</P
><P
>The <TT
CLASS="LITERAL"
>-p</TT
> option means that you want to convert
a path-style string rather than a single filename.  For example, the
PATH environment variable is semicolon-delimited in Windows, but
colon-delimited in UNIX.  By giving <TT
CLASS="LITERAL"
>-p</TT
> you are
instructing <B
CLASS="COMMAND"
>cygpath</B
> to convert between these
formats.</P
><P
>The <TT
CLASS="LITERAL"
>-i</TT
> option supresses the print out of the
usage message if no filename argument was given.  It can be used in
make file rules converting variables to a proper format that may be
omitted.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1009"
></A
><P
><B
>Example 5. Example cygpath usage</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>#!/bin/sh
for i in `echo *.exe | sed 's/\.exe/.cc/'`
do
  notepad "`cygpath -w $i`"
done</PRE
></TD
></TR
></TABLE
></DIV
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="KILL"
>kill</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: kill [-f] [-sigN] pid1 [pid2 ...]</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>kill</B
> program allows you to send arbitrary
signals to other Cygwin programs.  The usual purpose is to end a
running program from some other window when ^C won't work, but you can
also send program-specified signals such as SIGUSR1 to trigger actions
within the program, like enabling debugging or re-opening log files.
Each program defines the signals they understand.</P
><P
>Note that, unless you specific the <TT
CLASS="LITERAL"
>-f</TT
> option,
the "pid" values are the Cygwin pids, not the Windows pids.  To get a
list of running programs and their Cygwin pids, use the Cygwin
<B
CLASS="COMMAND"
>ps</B
> program. <B
CLASS="COMMAND"
>ps -W</B
> will display
<I
CLASS="EMPHASIS"
>all</I
> windows pids.</P
><P
>To send a specific signal, use the <TT
CLASS="LITERAL"
>-signN</TT
>
option, either with a signal number or a signal name (minus the "SIG"
part), like these examples:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1024"
></A
><P
><B
>Example 6. Using the kill command</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>kill 123</B
></TT
>
<TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>kill -1 123</B
></TT
>
<TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>kill -HUP 123</B
></TT
>
<TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>kill -f 123</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
><P
>Here is a list of available signals, their numbers, and some
commentary on them, from the file
<TT
CLASS="LITERAL"
>&#60;sys/signal.h&#62;</TT
>, which should be considered
the official source of this information.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>SIGHUP       1    hangup
SIGINT       2    interrupt
SIGQUIT      3    quit
SIGILL       4    illegal instruction (not reset when caught)
SIGTRAP      5    trace trap (not reset when caught)
SIGABRT      6    used by abort
SIGEMT       7    EMT instruction
SIGFPE       8    floating point exception
SIGKILL      9    kill (cannot be caught or ignored)
SIGBUS      10    bus error
SIGSEGV     11    segmentation violation
SIGSYS      12    bad argument to system call
SIGPIPE     13    write on a pipe with no one to read it
SIGALRM     14    alarm clock
SIGTERM     15    software termination signal from kill
SIGURG      16    urgent condition on IO channel
SIGSTOP     17    sendable stop signal not from tty
SIGTSTP     18    stop signal from tty
SIGCONT     19    continue a stopped process
SIGCHLD     20    to parent on child stop or exit
SIGCLD      20    System V name for SIGCHLD
SIGTTIN     21    to readers pgrp upon background tty read
SIGTTOU     22    like TTIN for output if (tp-&#62;t_local&#38;LTOSTOP)
SIGIO       23    input/output possible signal
SIGPOLL     23    System V name for SIGIO
SIGXCPU     24    exceeded CPU time limit
SIGXFSZ     25    exceeded file size limit
SIGVTALRM   26    virtual time alarm
SIGPROF     27    profiling time alarm
SIGWINCH    28    window changed
SIGLOST     29    resource lost (eg, record-lock lost)
SIGUSR1     30    user defined signal 1
SIGUSR2     31    user defined signal 2</PRE
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="MKGROUP"
>mkgroup</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>usage: mkgroup &#60;options&#62; [domain]
This program prints group information to stdout
Options:\n");
    -l,--local           print pseudo group information if there is
                         no domain
    -d,--domain          print global group information from the domain
                         specified (or from the current domain if there is
                         no domain specified)
    -?,--help            print this message</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>mkgroup</B
> program can be used to help
configure your Windows system to be more UNIX-like by creating an
initial <TT
CLASS="FILENAME"
>/etc/group</TT
> substitute (some commands need this
file) from your system information. It only works on NT.
To initially set up your machine,
you'd do something like this:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1044"
></A
><P
><B
>Example 7. Setting up the groups file</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>mkdir /etc</B
></TT
>
<TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>mkgroup -l &#62; /etc/group</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
><P
>Note that this information is static.  If you change the group
information in your system, you'll need to regenerate the group file
for it to have the new information.</P
><P
>The <TT
CLASS="LITERAL"
>-d</TT
> and <TT
CLASS="LITERAL"
>-l</TT
> options
allow you to specify where the information comes from, either the
local machine or the default (or given) domain.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="MKPASSWD"
>mkpasswd</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: mkpasswd [options] [domain]
This program prints a /etc/passwd file to stdout
Options are
   -l,--local              print local accounts
   -d,--domain             print domain accounts (from current domain
                           if no domain specified
   -g,--local-groups       print local group information too
   -?,--help               displays this message
This program does only work on Windows NT</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>mkpasswd</B
> program can be used to help
configure your Windows system to be more UNIX-like by creating an
initial <TT
CLASS="FILENAME"
>/etc/passwd</TT
> substitute (some commands
need this file) from your system information. It only works on NT.
To initially set up your machine, you'd do something like this:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1061"
></A
><P
><B
>Example 8. Setting up the passwd file</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>mkdir /etc</B
></TT
>
<TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>mkpasswd -l &#62; /etc/passwd</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
><P
>Note that this information is static.  If you change the user
information in your system, you'll need to regenerate the passwd file
for it to have the new information.</P
><P
>The <TT
CLASS="LITERAL"
>-d</TT
> and <TT
CLASS="LITERAL"
>-l</TT
> options
allow you to specify where the information comes from, either the
local machine or the default (or given) domain.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="PASSWD"
>passwd</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage passwd [name]
      passwd [-x max] [-n min] [-i inact] [-L len]
      passwd {-l|-u|-S} name
  -x max   set max age of passwords
  -n min   set min age of passwords
  -i inact disables account after inact days of expiry
  -L len   set min password length
  -l       lock an account
  -u       unlock an account
  -S       show account information</PRE
></TD
></TR
></TABLE
><P
> <B
CLASS="COMMAND"
>passwd</B
> changes passwords for user accounts.
A normal user may only change the password for their own account,
the administrators may change the password for any account.
<B
CLASS="COMMAND"
>passwd</B
> also changes account information, such as
password expiry dates and intervals.</P
><P
>Password changes: The user is first prompted for their old
password, if one is present.  This password is then encrypted and
compared against the stored password.  The user has only one chance to
enter the correct password.  The administrators are permitted to
bypass this step so that forgotten passwords may be changed.</P
><P
>The user is then prompted for a replacement password.
<B
CLASS="COMMAND"
>passwd</B
> will prompt again and compare the second entry
against the first.  Both entries are require to match in order for the
password to be changed.</P
><P
>After the password has been entered, password aging information
is checked to see if the user is permitted to change their password
at this time.  If not, <B
CLASS="COMMAND"
>passwd</B
> refuses to change the
password and exits.</P
><P
>Password expiry and length: The password aging information may be
changed by the administrators with the <TT
CLASS="LITERAL"
>-x</TT
>,
<TT
CLASS="LITERAL"
>-n</TT
> and <TT
CLASS="LITERAL"
>-i</TT
> options.  The
<TT
CLASS="LITERAL"
>-x</TT
> option is used to set the maximum number of days
a password remains valid.  After <I
CLASS="EMPHASIS"
>max</I
> days, the
password is required to be changed.  The <TT
CLASS="LITERAL"
>-n</TT
> option is
used to set the minimum number of days before a password may be changed.
The user will not be permitted to change the password until
<I
CLASS="EMPHASIS"
>min</I
> days have elapsed.  The <TT
CLASS="LITERAL"
>-i</TT
>
option is used to disable an account after the password has been expired
for a number of days.  After a user account has had an expired password
for <I
CLASS="EMPHASIS"
>inact</I
> days, the user may no longer sign on to
the account. Allowed values for the above options are 0 to 999.  The
<TT
CLASS="LITERAL"
>-L</TT
> option sets the minimum length of allowed passwords
for users, which doesn't belong to the administrators group, to
<I
CLASS="EMPHASIS"
>len</I
> characters.  Allowed values for the minimum
password length are 0 to 14.  In any of the above cases, a value of 0
means `no restrictions'.</P
><P
>Account maintenance: User accounts may be locked and unlocked with the
<TT
CLASS="LITERAL"
>-l</TT
> and <TT
CLASS="LITERAL"
>-u</TT
> flags.  The
<TT
CLASS="LITERAL"
>-l</TT
> option disables an account.  The <TT
CLASS="LITERAL"
>-u</TT
>
option re-enables an account.</P
><P
>The account status may be given with the <TT
CLASS="LITERAL"
>-S</TT
>
option.  The status information is self explanatory.</P
><P
>Limitations: Users may not be able to change their password on
some systems.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="MOUNT"
>mount</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage mount
      mount [-bfs] &#60;win32path&#62; &#60;posixpath&#62;
      mount [-bs] --change-cygdrive-prefix&#60;posixpath&#62;
      mount --import-old-mounts

  -b = text files are equivalent to binary files (newline = \n)
  -x = files in the mounted directory are automatically given execute permission.
  -X = files in the mounted directory are automatically given execute permission and are assumed to be Cygwin (i.e., not generic windows) executables only.
  -f = force mount, don't warn about missing mount point directories
  -s = add mount point to system-wide registry location
  --change-automount-prefix = change path prefix used for automatic mount points
  --import-old-mounts = copy old registry mount table mounts into the current mount areas

  When invoked without any arguments, mount displays the current mount table.</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>mount</B
> program is used to map your drives
and shares onto Cygwin's simulated POSIX directory tree, much like as is
done by mount commands on typical UNIX systems.  Please see
<A
HREF="using.html#MOUNT-TABLE"
>the Section called <I
>The Cygwin Mount Table</I
></A
> for more information on the concepts
behind the Cygwin POSIX file system and strategies for using
mounts.</P
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN1109"
>Using mount</A
></H3
><P
>If you just type <B
CLASS="COMMAND"
>mount</B
> with no parameters, it
will display the current mount table for you.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1113"
></A
><P
><B
>Example 9. Displaying the current set of mount points</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>c:\cygnus\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>mount</B
></TT
>
Device           Directory           Type        Flags
D:               /d                  user        textmode
C:               /                   system      textmode</PRE
></TD
></TR
></TABLE
></DIV
><P
>In this example, the C
drive is the POSIX root and D drive is mapped to
<TT
CLASS="FILENAME"
>/d</TT
>.  Note that in this case, the root mount is a
system-wide mount point that is visible to all users running Cygwin
programs, whereas the <TT
CLASS="FILENAME"
>/d</TT
> mount is only visible
to the current user.</P
><P
>The <B
CLASS="COMMAND"
>mount</B
> utility is also the mechanism for
adding new mounts to the mount table.  The following example
demonstrates how to mount the directory
<TT
CLASS="FILENAME"
>C:\cygnus\cygwin-b20\H-i586-cygwin32\bin</TT
>
to <TT
CLASS="FILENAME"
>/bin</TT
> and the network directory
<TT
CLASS="FILENAME"
>\\pollux\home\joe\data</TT
> to <TT
CLASS="FILENAME"
>/data</TT
>.
<TT
CLASS="FILENAME"
>/bin</TT
> is assumed to already exist.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1128"
></A
><P
><B
>Example 10. Adding mount points</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>c:\cygnus\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>ls /bin /data</B
></TT
>
ls: /data: No such file or directory
<TT
CLASS="PROMPT"
>c:\cygnus\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>mount C:\cygnus\cygwin-b20\H-i586-cygwin32\bin /bin</B
></TT
>
<TT
CLASS="PROMPT"
>c:\cygnus\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>mount \\pollux\home\joe\data /data</B
></TT
>
Warning: /data does not exist!
<TT
CLASS="PROMPT"
>c:\cygnus\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>mount</B
></TT
>
Device           Directory           Type        Flags
\\pollux\home\joe\data   /data       user        textmode
C:\cygnus\cygwin-b20\H-i586-cygwin32\bin   /bin   user   textmode
D:               /d                  user        textmode
\\.\tape1:       /dev/st1            user        textmode
\\.\tape0:       /dev/st0            user        textmode
\\.\b:           /dev/fd1            user        textmode
\\.\a:           /dev/fd0            user        textmode
C:               /                   system      textmode
<TT
CLASS="PROMPT"
>c:\cygnus\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>ls /bin/sh</B
></TT
>
/bin/sh</PRE
></TD
></TR
></TABLE
></DIV
><P
>Note that <B
CLASS="COMMAND"
>mount</B
> was invoked from the Windows
command shell in the previous example.  In many Unix shells, including
bash, it is legal and convenient to use the forward "/" in Win32
pathnames since the "\" is the shell's escape character. </P
><P
>The "-s" flag to <B
CLASS="COMMAND"
>mount</B
> is used to add a mount
in the system-wide mount table used by all Cygwin users on the system,
instead of the user-specific one.  System-wide mounts are displayed
by <B
CLASS="COMMAND"
>mount</B
> as being of the "system" type, as is the
case for the <TT
CLASS="FILENAME"
>/</TT
> partition in the last example.
Under Windows NT, only those users with Administrator priviledges are
permitted to modify the system-wide mount table.</P
><P
>Note that a given POSIX path may only exist once in the user
table and once in the global, system-wide table.  Attempts to replace
the mount will fail with a busy error.  The "-f" (force) flag causes
the old mount to be silently replaced with the new one.  It will also
silence warnings about the non-existence of directories at the Win32
path location.</P
><P
>The "-b" flag is used to instruct Cygwin to treat binary and
text files in the same manner by default.  Binary mode mounts are
marked as "binmode" in the Flags column of <B
CLASS="COMMAND"
>mount</B
>
output.  By default, mounts are in text mode ("textmode" in the Flags
column).</P
><P
>The "-x" flag is used to instruct Cygwin that the mounted file
is "executable".  If the "-x" flag is used with a directory then
all files in the directory are executable.  Files ending in certain
extensions (.exe, .com, .bat, .cmd) are assumed to be executable
by default.  Files whose first two characters begin with '#!' are
also considered to be executable.  This option allows other files
to be marked as executable and avoids the overhead of opening each
file to check for a '#!'.</P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN1151"
>Cygdrive mount points</A
></H3
><P
>Whenever Cygwin cannot use any of the existing mounts to convert
from a particular Win32 path to a POSIX one, Cygwin will, instead,
convert to a POSIX path using a default mount point:
<TT
CLASS="FILENAME"
>/cygdrive</TT
>.  For example, if Cygwin accesses
<TT
CLASS="FILENAME"
>Z:\foo</TT
> and the Z drive is not currently in the
mount table, then <TT
CLASS="FILENAME"
>Z:\</TT
> will be accessible as
<TT
CLASS="FILENAME"
>/cygdrive/Z</TT
>.  The default prefix of
<TT
CLASS="FILENAME"
>/cygdrive</TT
> may be changed via the
<A
HREF="using-utils.html#MOUNT"
>the Section called <I
>mount</I
></A
> command.</P
><P
>The <B
CLASS="COMMAND"
>mount</B
> utility can be used to change this
default automount prefix through the use of the
"--change-cygdrive-prefix" flag.  In the following example, we will
set the automount prefix to <TT
CLASS="FILENAME"
>/</TT
>:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1163"
></A
><P
><B
>Example 11. Changing the default prefix</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>c:\cygnus\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>mount --change-cygdrive-prefix /</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
><P
>Note that you if you set a new prefix in this manner, you can
specify the "-s" flag to make this the system-wide default prefix.  By
default, the cygdrive-prefix applies only to the current user.  In the
same way, you can specify the "-b" flag such that all new automounted
filesystems default to binary mode file accesses.</P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN1169"
>Limitations</A
></H3
><P
>Limitations: there is a hard-coded limit of 30 mount
points.  Also, although you can mount to pathnames that do not start
with "/", there is no way to make use of such mount points.</P
><P
>Normally the POSIX mount point in Cygwin is an existing empty
directory, as in standard UNIX. If this is the case, or if there is a
place-holder for the mount point (such as a file, a symbolic link
pointing anywhere, or a non-empty directory), you will get the expected
behavior. Files present in a mount point directory before the mount
become invisible to Cygwin programs.</P
><P
>It is sometimes desirable to mount to a non-existent directory,
for example to avoid cluttering the root directory with names
such as
<TT
CLASS="FILENAME"
>a</TT
>, <TT
CLASS="FILENAME"
>b</TT
>, <TT
CLASS="FILENAME"
>c</TT
>
pointing to disks.
Although <B
CLASS="COMMAND"
>mount</B
> will give you a warning, most
everything will work properly when you refer to the mount point
explicitly.  Some strange effects can occur however.
For example if your current working directory is
<TT
CLASS="FILENAME"
>/dir</TT
>,
say, and <TT
CLASS="FILENAME"
>/dir/mtpt</TT
> is a mount point, then
<TT
CLASS="FILENAME"
>mtpt</TT
> will not show up in an <B
CLASS="COMMAND"
>ls</B
>
or
<B
CLASS="COMMAND"
>echo *</B
> command and <B
CLASS="COMMAND"
>find .</B
> will
not
find <TT
CLASS="FILENAME"
>mtpt</TT
>.</P
></DIV
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="PS"
>ps</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage ps [-aefl] [-u uid]
  -a, -e   show processes of all users
  -f       show process uids, ppids
  -l       show process uids, ppids, pgids, winpids
  -s	   short process listing
  -u uid   show processes owned by uid
  -W	   show all windows processes, not just cygwin processes</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>ps</B
> program gives the status of all the
Cygwin processes running on the system (ps = "process status").  Due
to the limitations of simulating a POSIX environment under Windows,
there is little information to give.  The PID column is the process ID
you need to give to the <B
CLASS="COMMAND"
>kill</B
> command.  The WINPID
column is the process ID that's displayed by NT's Task Manager
program.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="UMOUNT"
>umount</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage umount [-s] &#60;posixpath&#62;
-s = remove mount point from system-wide registry location

--remove-all-mounts = remove all mounts
--remove-auto-mounts = remove all automatically mounted mounts
--remove-user-mounts = remove all mounts in the current user mount registry area, including auto mounts
--remove-system-mounts = Remove all mounts in the system-wide mount registry area</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>umount</B
> program removes mounts from the
mount table.  If you specify a POSIX path that corresponds to a
current mount point, <B
CLASS="COMMAND"
>umount</B
> will remove it from the
user-specific registry area.  The -s flag may be used to specify
removing the mount from the system-wide registry area instead
(Administrator priviledges are required).</P
><P
>The <B
CLASS="COMMAND"
>umount</B
> utility may also be used to remove
all mounts of a particular type.  With the extended options it is
possible to remove all mounts, all automatically-mounted mounts, all
mounts in the current user's registry area, or all mounts in the
system-wide registry area (with Administrator priviledges).</P
><P
>See <A
HREF="using-utils.html#MOUNT"
>the Section called <I
>mount</I
></A
>) for more information on the mount
table.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="STRACE"
>strace</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage strace [-m mask] [-o output-file] [ft] program [args...]

-b n		  use buffer of size 'n' when writing output file
-d		  include delta time in usecs for each line (default)
-f		  follow all forks and execs
-m mask		  mask for reporting cygwin events (default 1)
-n		  convert Win32 error messages to text
-o output-file	  output file to hold strace events (default stderr)
-t		  output time in hh:mm:ss format
-u		  include time in usecs since start for each line (default)</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>strace</B
> program executes a program, and
optionally the children of the program, reporting any Cygwin DLL output
from the program(s) to file.  This program is mainly useful for debugging
the Cygwin DLL itself.

The mask argument is a hexadecimal string signifying which events should be
reported.  The valid bits to set are as follows:</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>  Bit			Explanation
0x00000001		All strace output is collected
0x00000008		Unusual or weird phenomenon
0x00000010		System calls
0x00000020		argv/envp printout at startup
0x00000040		Information useful for DLL debugging
0x00000080		Paranoid information
0x00000100		Termios debbugging
0x00000200		Select() function debugging
0x00000400		Window message debugging
0x00000800		Signal and process handling
0x00001000		Very minimal strace output
0x00020000		Malloc calls
0x00040000		Thread locking calls</PRE
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="REGTOOL"
>regtool</A
></H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Regtool Copyright (c) 2000 Red Hat Inc
 regtool -h  - print this message
 regtool [-v|-p|-k|-l] list [key]  - list subkeys and values
     -p=postfix, like ls -p, appends / postfix to key names
     -k=keys, lists only keys
     -l=values, lists only values
 regtool [-v] add [key\subkey]  - add new subkey
 regtool [-v] remove [key]  - remove key
 regtool [-v|-q] check [key]  - exit 0 if key exists, 1 if not
 regtool [-i|-s|-e|-m] set [key\value] [data ...]  - set value
     -i=integer -s=string -e=expand-string -m=multi-string
 regtool [-v] unset [key\value]  - removes value from key
 regtool [-q] get [key\value]  - prints value to stdout
     -q=quiet, no error msg, just return nonzero exit if key/value missing
 keys are like \prefix\key\key\key\value, where prefix is any of:
   root     HKCR  HKEY_CLASSES_ROOT
   config   HKCC  HKEY_CURRENT_CONFIG
   user     HKCU  HKEY_CURRENT_USER
   machine  HKLM  HKEY_LOCAL_MACHINE
   users    HKU   HKEY_USERS
 example: \user\software\Microsoft\Clock\iFormat</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>regtool</B
> program allows shell scripts
to access and modify the Windows registry.  Note that modifying the
Windows registry is dangerous, and carelessness here can result
in an unusable system.  Be careful.</P
><P
>The <TT
CLASS="LITERAL"
>-v</TT
> option means "verbose".  For most
commands, this causes additional or lengthier messages to be printed.
Conversely, the <TT
CLASS="LITERAL"
>-q</TT
> option supresses error messages,
so you can use the exit status of the program to detect if a key
exists or not (for example).</P
><P
>The <TT
CLASS="LITERAL"
>list</TT
> command lists the subkeys and values
belonging to the given key.  The <TT
CLASS="LITERAL"
>add</TT
> command adds a
new key.  The <TT
CLASS="LITERAL"
>remove</TT
> command removes a key.  Note
that you may need to remove everything in the key before you may
remove it, but don't rely on this stopping you from accidentally
removing too much.  The <TT
CLASS="LITERAL"
>check</TT
> command checks to see
if a key exists (the exit code of the program is zero if it does,
nonzero if it does not).</P
><P
>The <TT
CLASS="LITERAL"
>set</TT
> command sets a value within a key.
<TT
CLASS="LITERAL"
>-i</TT
> means the value is an integer (DWORD).
<TT
CLASS="LITERAL"
>-s</TT
> means the value is a string.
<TT
CLASS="LITERAL"
>-e</TT
> means it's an expanding string (it contains
embedded environment variables).  <TT
CLASS="LITERAL"
>-m</TT
> means it's a
multi-string (list).  If you don't specify one of these, it tries to
guess the type based on the value you give.  If it looks like a
number, it's a number.  If it starts with a percent, it's an expanding
string.  If you give multiple values, it's a multi-string.  Else, it's
a regular string.</P
><P
>The <TT
CLASS="LITERAL"
>unset</TT
> command removes a value from a key.
The <TT
CLASS="LITERAL"
>get</TT
> command gets the value of a value of a key,
and prints it (and nothing else) to stdout.  Note: if the value
doesn't exist, an error message is printed and the program returns a
non-zero exit code.  If you give <TT
CLASS="LITERAL"
>-q</TT
>, it doesn't
print the message but does return the non-zero exit code.</P
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="using-cygwinenv.html"
ACCESSKEY="P"
>&#60;&#60;&#60; Previous</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="cygwin-ug-net.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="programming.html"
ACCESSKEY="N"
>Next &#62;&#62;&#62;</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>The <TT
CLASS="ENVAR"
>CYGWIN</TT
> environment
variable</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="using.html"
ACCESSKEY="U"
>Up</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Programming with Cygwin</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>