<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01//EN">
<HTML
><HEAD
><TITLE
>Cygwin Utilities</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.76b+
"><LINK
REL="HOME"
TITLE="Cygwin User's Guide"
HREF="cygwin-ug-net.html"><LINK
REL="UP"
TITLE="Using Cygwin"
HREF="using.html"><LINK
REL="PREVIOUS"
TITLE="The CYGWIN environment
variable"
HREF="using-cygwinenv.html"><LINK
REL="NEXT"
TITLE="Programming with Cygwin"
HREF="programming.html"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Cygwin User's Guide</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="using-cygwinenv.html"
ACCESSKEY="P"
>&#60;&#60;&#60; Previous</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Using Cygwin</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="programming.html"
ACCESSKEY="N"
>Next &#62;&#62;&#62;</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="USING-UTILS"
></A
>Cygwin Utilities</H1
><P
>Cygwin comes with a number of command-line utilities that are
used to manage the UNIX emulation portion of the Cygwin environment.
While many of these reflect their UNIX counterparts, each was written
specifically for Cygwin.  You may use the long or short option names 
interchangeably; for example, <TT
CLASS="LITERAL"
>--help</TT
> and 
<TT
CLASS="LITERAL"
>-h</TT
> function identically. All of the Cygwin 
command-line utilities support the <TT
CLASS="LITERAL"
>--help</TT
> and
<TT
CLASS="LITERAL"
>--version</TT
> options. </P
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="CYGCHECK"
></A
>cygcheck</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: cygcheck [OPTIONS] [program ...]
 -c, --check-setup  check packages installed via setup.exe
 -s, --sysinfo      system information (not with -k)
 -v, --verbose      verbose output (indented) (for -s or programs)
 -r, --registry     registry search (requires -s)
 -k, --keycheck     perform a keyboard check session (not with -s)
 -h, --help         give help about the info (not with -c)
 -V, --version      output version information and exit
You must at least give either -s or -k or a program name</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>cygcheck</B
> program is a diagnostic utility
that examines your system and reports the information that is
significant to the proper operation of Cygwin programs.  It can give
information about specific programs or libraries you are trying to
run, general system information, or both.  If you list one or more
programs on the command line, it will diagnose the runtime environment
of that program or programs, providing the names of DLL files on which
the program depends.  If you specify the <TT
CLASS="LITERAL"
>-s</TT
>
option, it will give general system information.  If you specify
<TT
CLASS="LITERAL"
>-s</TT
> and list one or more programs on the command line,
it reports on both.</P
><P
>The <TT
CLASS="LITERAL"
>-h</TT
> option prints additional helpful
messages in the report, at the beginning of each section.  It also
adds table column headings.  While this is useful information, it also
adds some to the size of the report, so if you want a compact report
or if you know what everything is already, just leave this out.</P
><P
>The <TT
CLASS="LITERAL"
>-v</TT
> option causes the output to be more
verbose.  What this means is that additional information will be
reported which is usually not interesting, such as the internal
version numbers of DLLs, additional information about recursive DLL
usage, and if a file in one directory in the PATH also occurs in other
directories on the PATH.  </P
><P
>The <TT
CLASS="LITERAL"
>-r</TT
> option causes
<B
CLASS="COMMAND"
>cygcheck</B
> to search your registry for information
that is relevent to Cygwin programs.  These registry entries are the
ones that have "Cygwin" in the name.  If you are paranoid about
privacy, you may remove information from this report, but please keep
in mind that doing so makes it harder to diagnose your problems.</P
><P
>The <TT
CLASS="LITERAL"
>-c</TT
> option causes the arguments
to be interpreted as package names.  <B
CLASS="COMMAND"
>cygcheck</B
> will
report the current version of the package that you specify, or with no
arguments, on all packages.</P
><P
>The <B
CLASS="COMMAND"
>cygcheck</B
> program should be used to send
information about your system for troubleshooting when requested.  
When asked to run this command save the output so that you can email it,
for example:</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>C:\cygwin&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>cygcheck -s -v -r -h &#62; cygcheck_output.txt</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="CYGPATH"
></A
>cygpath</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: cygpath (-d|-m|-u|-w|-t TYPE) [-c HANDLE] [-f FILE] [options] NAME
       cygpath [-ADHPSW] 
Output type options:
  -d, --dos             print DOS (short) form of NAME (C:\PROGRA~1\)
  -m, --mixed           like --windows, but with regular slashes (C:/WINNT)
  -u, --unix            (default) print Unix form of NAME (/cygdrive/c/winnt)
  -w, --windows         print Windows form of NAME (C:\WINNT)
  -t, --type TYPE       print TYPE form: 'dos', 'mixed', 'unix', or 'windows'
Path conversion options:
  -a, --absolute        output absolute path
  -l, --long-name       print Windows long form of NAME (with -w, -m only)
  -p, --path            NAME is a PATH list (i.e., '/bin:/usr/bin')
  -s, --short-name      print DOS (short) form of NAME (with -w, -m only)
System information:
  -A, --allusers        use `All Users' instead of current user for -D, -P
  -D, --desktop         output `Desktop' directory and exit
  -H, --homeroot        output `Profiles' directory (home root) and exit
  -P, --smprograms      output Start Menu `Programs' directory and exit
  -S, --sysdir          output system directory and exit
  -W, --windir          output `Windows' directory and exit</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>cygpath</B
> program is a utility that
converts Windows native filenames to Cygwin POSIX-style pathnames and
vice versa.  It can be used when a Cygwin program needs to pass a file 
name to a native Windows program, or expects to get a file name from a
native Windows program.  Alternatively, <B
CLASS="COMMAND"
>cygpath</B
> can 
output information about the location of important system directories 
in either format.  </P
><P
>The <TT
CLASS="LITERAL"
>-u</TT
> and <TT
CLASS="LITERAL"
>-w</TT
> options
indicate whether you want a conversion to UNIX (POSIX) format 
(<TT
CLASS="LITERAL"
>-u</TT
>) or to Windows format (<TT
CLASS="LITERAL"
>-w</TT
>).  
Use the <TT
CLASS="LITERAL"
>-d</TT
> to get DOS-style (8.3) file and path names.
The <TT
CLASS="LITERAL"
>-m</TT
> option will output Windows-style format
but with forward slashes instead of backslashes.  This option is 
especially useful in shell scripts, which use backslashes as an escape 
character.</P
><P
> In combination with the <TT
CLASS="LITERAL"
>-w</TT
> option, you can use
the <TT
CLASS="LITERAL"
>-l</TT
> and <TT
CLASS="LITERAL"
>-s</TT
> options to use normal
(long) or DOS-style (short) form. The <TT
CLASS="LITERAL"
>-d</TT
> option is 
identical to <TT
CLASS="LITERAL"
>-w</TT
> and <TT
CLASS="LITERAL"
>-s</TT
> together.</P
><P
>Caveat: The <TT
CLASS="LITERAL"
>-l</TT
> option does not work if the
<I
CLASS="EMPHASIS"
>check_case</I
> parameter of <I
CLASS="EMPHASIS"
>CYGWIN</I
> 
is set to <I
CLASS="EMPHASIS"
>strict</I
>, since Cygwin is not able to match 
any Windows short path in this mode.</P
><P
>The <TT
CLASS="LITERAL"
>-p</TT
> option means that you want to convert
a path-style string rather than a single filename.  For example, the
PATH environment variable is semicolon-delimited in Windows, but
colon-delimited in UNIX.  By giving <TT
CLASS="LITERAL"
>-p</TT
> you are
instructing <B
CLASS="COMMAND"
>cygpath</B
> to convert between these
formats.</P
><P
>The <TT
CLASS="LITERAL"
>-i</TT
> option supresses the print out of the
usage message if no filename argument was given.  It can be used in
make file rules converting variables that may be omitted
to a proper format.  Note that <B
CLASS="COMMAND"
>cygpath</B
> output may 
contain spaces (C:\Program Files) so should be enclosed in quotes.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN901"
></A
><P
><B
>Example 3. Example cygpath usage</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>#!/bin/sh
if [ "${1}" = "" ];
	then
		XPATH=".";
	else
		XPATH="$(cygpath -w "${1}")";
	fi
	explorer $XPATH &#38;</PRE
></TD
></TR
></TABLE
></DIV
><P
>The capital options 
<TT
CLASS="LITERAL"
>-D</TT
>, <TT
CLASS="LITERAL"
>-H</TT
>, <TT
CLASS="LITERAL"
>-P</TT
>, 
<TT
CLASS="LITERAL"
>-S</TT
>, and <TT
CLASS="LITERAL"
>-W</TT
> output directories used 
by Windows that are not the same on all systems, for example 
<TT
CLASS="LITERAL"
>-S</TT
> might output C:\WINNT\SYSTEM32 or C:\WINDOWS\SYSTEM. 
The <TT
CLASS="LITERAL"
>-H</TT
> shows the Windows profiles directory that can 
be used as root of home.  The <TT
CLASS="LITERAL"
>-A</TT
> option forces use of 
the "All Users" directories instead of the current user for the 
<TT
CLASS="LITERAL"
>-D</TT
> and <TT
CLASS="LITERAL"
>-P</TT
> options. 
On Win9x systems with only a single user, <TT
CLASS="LITERAL"
>-A</TT
> has no
effect; <TT
CLASS="LITERAL"
>-D</TT
> and <TT
CLASS="LITERAL"
>-AD</TT
> would have the
same output.  By default the output is in UNIX (POSIX) format; 
use the <TT
CLASS="LITERAL"
>-w</TT
> or <TT
CLASS="LITERAL"
>-d</TT
> options to get
other formats.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="DUMPER"
></A
>dumper</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: dumper [OPTION] FILENAME WIN32PID
Dump core from WIN32PID to FILENAME.core
-d, --verbose  be verbose while dumping
-h, --help     output help information and exit
-q, --quiet    be quiet while dumping (default)
-v, --version  output version information and exit</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>dumper</B
> utility can be used to create a
core dump of running Windows process. This core dump can be later loaded
to <B
CLASS="COMMAND"
>gdb</B
> and analyzed. One common way to use 
<B
CLASS="COMMAND"
>dumper</B
> is to plug it into cygwin's Just-In-Time 
debugging facility by adding

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>error_start=x:\path\to\dumper.exe</PRE
></TD
></TR
></TABLE
>

to the <I
CLASS="EMPHASIS"
>CYGWIN</I
> environment variable. Please note that
<TT
CLASS="LITERAL"
>x:\path\to\dumper.exe</TT
> is Windows-style and not cygwin
path. If <TT
CLASS="LITERAL"
>error_start</TT
> is set this way, then dumper will
be started whenever some program encounters a fatal error.</P
><P
><B
CLASS="COMMAND"
>dumper</B
> can be also be started from the command line to 
create a core dump of any running process. Unfortunately, because of a Windows 
API limitation, when a core dump is created and <B
CLASS="COMMAND"
>dumper</B
> 
exits, the target process is terminated too.</P
><P
>To save space in the core dump, <B
CLASS="COMMAND"
>dumper</B
> doesn't write those
portions of target process' memory space that are loaded from executable and
dll files and are unchangeable, such as program code and debug info. Instead,
<B
CLASS="COMMAND"
>dumper</B
> saves paths to files which contain that data. When a
core dump is loaded into gdb, it uses these paths to load appropriate files.
That means that if you create a core dump on one machine and try to debug it on
another, you'll need to place identical copies of the executable and dlls in 
the same directories as on the machine where the core dump was created.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="GETFACL"
></A
>getfacl</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: getfacl [-adn] FILE [FILE2...]
Display file and directory access control lists (ACLs).

  -a, --all      display the filename, the owner, the group, and
                 the ACL of the file
  -d, --dir      display the filename, the owner, the group, and
                 the default ACL of the directory, if it exists
  -h, --help     output usage information and exit
  -n, --noname   display user and group IDs instead of names
  -v, --version  output version information and exit

When multiple files are specified on the command line, a blank
line separates the ACLs for each file.</PRE
></TD
></TR
></TABLE
><P
>For each argument that is a regular file, special file or
directory, <B
CLASS="COMMAND"
>getfacl</B
> displays the owner, the group, and the 
ACL.  For directories <B
CLASS="COMMAND"
>getfacl</B
> displays additionally the 
default ACL.  With no options specified, <B
CLASS="COMMAND"
>getfacl</B
> displays 
the filename, the owner, the group, and both the ACL and the default ACL, if 
it exists. For more information on Cygwin and Windows ACLs, see
see <A
HREF="ntsec.html"
>the Section called <I
>NT security and the <TT
CLASS="LITERAL"
>ntsec</TT
> usage</I
> in the chapter called <I
>Setting Up Cygwin</I
></A
> in the Cygwin User's Guide.
The format for ACL output is as follows:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>     # file: filename
     # owner: name or uid
     # group: name or uid
     user::perm
     user:name or uid:perm
     group::perm
     group:name or gid:perm
     mask:perm
     other:perm
     default:user::perm
     default:user:name or uid:perm
     default:group::perm
     default:group:name or gid:perm
     default:mask:perm
     default:other:perm</PRE
></TD
></TR
></TABLE
></P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="KILL"
></A
>kill</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: kill [-f] [-signal] [-s signal] pid1 [pid2 ...]
       kill -l [signal]
 -f, --force     force, using win32 interface if necessary
 -l, --list      print a list of signal names
 -s, --signal    send signal (use kill --list for a list)
 -h, --help      output usage information and exit
 -v, --version   output version information and exit</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>kill</B
> program allows you to send arbitrary
signals to other Cygwin programs.  The usual purpose is to end a
running program from some other window when ^C won't work, but you can
also send program-specified signals such as SIGUSR1 to trigger actions
within the program, like enabling debugging or re-opening log files.
Each program defines the signals they understand.</P
><P
>You may need to specify the full path to use <B
CLASS="COMMAND"
>kill</B
> 
from within some shells, including <B
CLASS="COMMAND"
>bash</B
>, the default Cygwin
shell. This is because <B
CLASS="COMMAND"
>bash</B
> defines a 
<B
CLASS="COMMAND"
>kill</B
> builtin function; see the <B
CLASS="COMMAND"
>bash</B
>
man page under <I
CLASS="EMPHASIS"
>BUILTIN COMMANDS</I
> for more information.
To make sure you are using the Cygwin version, try

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>$ /bin/kill --version</PRE
></TD
></TR
></TABLE
>

which should give the Cygwin <B
CLASS="COMMAND"
>kill</B
> version number and
copyright information.</P
><P
>Unless you specific the <TT
CLASS="LITERAL"
>-f</TT
> option, the "pid" values 
used by <B
CLASS="COMMAND"
>kill</B
> are the Cygwin pids, not the Windows pids.  
To get a list of running programs and their Cygwin pids, use the Cygwin
<B
CLASS="COMMAND"
>ps</B
> program. <B
CLASS="COMMAND"
>ps -W</B
> will display
<I
CLASS="EMPHASIS"
>all</I
> windows pids.</P
><P
>The <B
CLASS="COMMAND"
>kill -l</B
> option prints the name of the
given signal, or a list of all signal names if no signal is given.</P
><P
>To send a specific signal, use the <TT
CLASS="LITERAL"
>-signN</TT
>
option, either with a signal number or a signal name (minus the "SIG"
part), like these examples:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN970"
></A
><P
><B
>Example 4. Using the kill command</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>kill 123</B
></TT
>
<TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>kill -1 123</B
></TT
>
<TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>kill -HUP 123</B
></TT
>
<TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>kill -f 123</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
><P
>Here is a list of available signals, their numbers, and some
commentary on them, from the file
<TT
CLASS="LITERAL"
>&#60;sys/signal.h&#62;</TT
>, which should be considered
the official source of this information.</P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>SIGHUP       1    hangup
SIGINT       2    interrupt
SIGQUIT      3    quit
SIGILL       4    illegal instruction (not reset when caught)
SIGTRAP      5    trace trap (not reset when caught)
SIGABRT      6    used by abort
SIGEMT       7    EMT instruction
SIGFPE       8    floating point exception
SIGKILL      9    kill (cannot be caught or ignored)
SIGBUS      10    bus error
SIGSEGV     11    segmentation violation
SIGSYS      12    bad argument to system call
SIGPIPE     13    write on a pipe with no one to read it
SIGALRM     14    alarm clock
SIGTERM     15    software termination signal from kill
SIGURG      16    urgent condition on IO channel
SIGSTOP     17    sendable stop signal not from tty
SIGTSTP     18    stop signal from tty
SIGCONT     19    continue a stopped process
SIGCHLD     20    to parent on child stop or exit
SIGTTIN     21    to readers pgrp upon background tty read
SIGTTOU     22    like TTIN for output if (tp-&#62;t_local&#38;LTOSTOP)
SIGPOLL     23    System V name for SIGIO
SIGXCPU     24    exceeded CPU time limit
SIGXFSZ     25    exceeded file size limit
SIGVTALRM   26    virtual time alarm
SIGPROF     27    profiling time alarm
SIGWINCH    28    window changed
SIGLOST     29    resource lost (eg, record-lock lost)
SIGUSR1     30    user defined signal 1
SIGUSR2     31    user defined signal 2</PRE
></TD
></TR
></TABLE
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="MKGROUP"
></A
>mkgroup</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: mkgroup [OPTION]... [domain]

This program prints a /etc/group file to stdout

Options:
   -l,--local             print local group information
   -d,--domain            print global group information from the domain
                          specified (or from the current domain if there is
                          no domain specified)
   -o,--id-offset offset  change the default offset (10000) added to uids
                          in domain accounts.
   -s,--no-sids           don't print SIDs in pwd field
                          (this affects ntsec)
   -u,--users             print user list in gr_mem field
   -h,--help              print this message

   -v,--version           print version information and exit

One of `-l' or `-d' must be given on NT/W2K.</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>mkgroup</B
> program can be used to help
configure your Windows system to be more UNIX-like by creating an
initial <TT
CLASS="FILENAME"
>/etc/group</TT
> substitute (some commands need this
file) from your system information. It only works on the NT series
(Windows NT, 2000, and XP). <B
CLASS="COMMAND"
>mkgroup</B
> does not work on 
the Win9x series (Windows 95, 98, and Me) because they lack the security model 
to support it. To initially set up your machine, you'd do something like 
this:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN991"
></A
><P
><B
>Example 5. Setting up the groups file</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>mkdir /etc</B
></TT
>
<TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>mkgroup -l &#62; /etc/group</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
><P
>Note that this information is static.  If you change the group
information in your system, you'll need to regenerate the group file
for it to have the new information.</P
><P
>The <TT
CLASS="LITERAL"
>-d</TT
> and <TT
CLASS="LITERAL"
>-l</TT
> options
allow you to specify where the information comes from, either the
local machine or the default (or given) domain.  The <TT
CLASS="LITERAL"
>-o</TT
>
option allows for special cases (such as multiple domains) where the GIDs 
might match otherwise. The <TT
CLASS="LITERAL"
>-s</TT
>
option omits the NT Security Identifier (SID).  For more information on 
SIDs, see <A
HREF="ntsec.html"
>the Section called <I
>NT security and the <TT
CLASS="LITERAL"
>ntsec</TT
> usage</I
> in the chapter called <I
>Setting Up Cygwin</I
></A
> in the Cygwin User's Guide.  The
<TT
CLASS="LITERAL"
>-u</TT
> option causes <B
CLASS="COMMAND"
>mkgroup</B
> to 
enumerate the users for each group, placing the group members in the 
gr_mem (last) field.  Note that this can greatly increase
the time for <B
CLASS="COMMAND"
>mkgroup</B
> to run in a large domain.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="MKPASSWD"
></A
>mkpasswd</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: mkpasswd [OPTION]... [domain]

This program prints a /etc/passwd file to stdout

Options:
   -l,--local              print local user accounts
   -d,--domain             print domain accounts (from current domain
                           if no domain specified)
   -o,--id-offset offset   change the default offset (10000) added to uids
                           in domain accounts.
   -g,--local-groups       print local group information too
                           if no domain specified
   -m,--no-mount           don't use mount points for home dir
   -s,--no-sids            don't print SIDs in GCOS field
                           (this affects ntsec)
   -p,--path-to-home path  use specified path instead of user account home dir
   -u,--username username  only return information for the specified user
   -h,--help               displays this message
   -v,--version            version information and exit

One of `-l', `-d' or `-g' must be given on NT/W2K.</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>mkpasswd</B
> program can be used to help
configure your Windows system to be more UNIX-like by creating an
initial <TT
CLASS="FILENAME"
>/etc/passwd</TT
> substitute (some commands
need this file) from your system information. It only works on the NT series
(Windows NT, 2000, and XP). <B
CLASS="COMMAND"
>mkpasswd</B
> does not work on 
the Win9x series (Windows 95, 98, and Me) because they lack the security model 
to support it. To initially set up your machine, you'd do something like 
this:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1015"
></A
><P
><B
>Example 6. Setting up the passwd file</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>mkdir /etc</B
></TT
>
<TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>mkpasswd -l &#62; /etc/passwd</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
><P
>Note that this information is static.  If you change the user
information in your system, you'll need to regenerate the passwd file
for it to have the new information.</P
><P
>The <TT
CLASS="LITERAL"
>-d</TT
> and <TT
CLASS="LITERAL"
>-l</TT
> options
allow you to specify where the information comes from, either the
local machine or the default (or given) domain.  The <TT
CLASS="LITERAL"
>-o</TT
>
option allows for special cases (such as multiple domains) where the UIDs
might match otherwise.  The <TT
CLASS="LITERAL"
>-g</TT
> option creates a local
user that corresponds to each local group. This is because NT assigns groups
file ownership.  The <TT
CLASS="LITERAL"
>-m</TT
> option bypasses the current
mount table so that, for example, two users who have a Windows home 
directory of H: could mount them differently.  The <TT
CLASS="LITERAL"
>-s</TT
>
option omits the NT Security Identifier (SID).  For more information on
SIDs, see <A
HREF="ntsec.html"
>the Section called <I
>NT security and the <TT
CLASS="LITERAL"
>ntsec</TT
> usage</I
> in the chapter called <I
>Setting Up Cygwin</I
></A
> in the Cygwin User's Guide.  The
<TT
CLASS="LITERAL"
>-p</TT
> option causes <B
CLASS="COMMAND"
>mkpasswd</B
> to
use a prefix other than <TT
CLASS="LITERAL"
>/home/</TT
>. For example, this command:

<DIV
CLASS="EXAMPLE"
><A
NAME="AEN1034"
></A
><P
><B
>Example 7. Using an alternate home root</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>$</TT
> <TT
CLASS="USERINPUT"
><B
>mkpasswd -l -p "$(cygpath -H)" &#62; /etc/passwd</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
>

would put local users' home directories in the Windows 'Profiles' directory. 
The <TT
CLASS="LITERAL"
>-u</TT
> option allows <B
CLASS="COMMAND"
>mkpasswd</B
> to 
search for a specific username, greatly reducing the amount of time it 
takes in a large domain.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="MOUNT"
></A
>mount</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: mount [OPTION] [&#60;win32path&#62; &#60;posixpath&#62;]
  -b, --binary                  text files are equivalent to binary files
                                (newline = \n)
  -c, --change-cygdrive-prefix  change the cygdrive path prefix to &#60;posixpath&#62;
  -f, --force                   force mount, don't warn about missing mount
                                point directories
  -h, --help                    output usage information and exit
  -m, --mount-commands          write mount commands to replace user and
                                system mount points and cygdrive prefixes
  -p, --show-cygdrive-prefix    show user and/or system cygdrive path prefix
  -s, --system     (default)    add system-wide mount point
  -t, --text       (default)    text files get \r\n line endings
  -u, --user                    add user-only mount point
  -v, --version                 output version information and exit
  -x, --executable              treat all files under mount point as executables
  -E, --no-executable           treat all files under mount point as 
                                non-executables
  -X, --cygwin-executable       treat all files under mount point as cygwin
                                executables</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>mount</B
> program is used to map your drives
and shares onto Cygwin's simulated POSIX directory tree, much like as is
done by mount commands on typical UNIX systems.  Please see
<A
HREF="using.html#MOUNT-TABLE"
>the Section called <I
>The Cygwin Mount Table</I
></A
> for more information on the concepts
behind the Cygwin POSIX file system and strategies for using
mounts. To remove mounts, use <B
CLASS="COMMAND"
>umount</B
></P
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN1048"
></A
>Using mount</H3
><P
>If you just type <B
CLASS="COMMAND"
>mount</B
> with no parameters, it
will display the current mount table for you.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1052"
></A
><P
><B
>Example 8. Displaying the current set of mount points</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>c:\cygwin\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>mount</B
></TT
>
c:\cygwin\bin on /usr/bin type system (binmode)
c:\cygwin\lib on /usr/lib type system (binmode)
c:\cygwin on / type system (binmode)
c: on /c type user (binmode,noumount)
d: on /d type user (binmode,noumount)</PRE
></TD
></TR
></TABLE
></DIV
><P
>In this example, c:\cygwin is the POSIX root and D drive is mapped to
<TT
CLASS="FILENAME"
>/d</TT
>.  Note that in this case, the root mount is a
system-wide mount point that is visible to all users running Cygwin
programs, whereas the <TT
CLASS="FILENAME"
>/d</TT
> mount is only visible
to the current user.</P
><P
>The <B
CLASS="COMMAND"
>mount</B
> utility is also the mechanism for
adding new mounts to the mount table.  The following example
demonstrates how to mount the directory
<TT
CLASS="FILENAME"
>\\pollux\home\joe\data</TT
> to <TT
CLASS="FILENAME"
>/data</TT
>.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1064"
></A
><P
><B
>Example 9. Adding mount points</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>c:\cygwin\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>ls /data</B
></TT
>
ls: /data: No such file or directory
<TT
CLASS="PROMPT"
>c:\cygwin\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>mount \\pollux\home\joe\data /data</B
></TT
>
mount: warning - /data does not exist!
<TT
CLASS="PROMPT"
>c:\cygwin\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>mount</B
></TT
>
\\pollux\home\joe\data on /data type sytem (binmode)
c:\cygwin\bin on /usr/bin type system (binmode)
c:\cygwin\lib on /usr/lib type system (binmode)
c:\cygwin on / type system (binmode)
c: on /c type user (binmode,noumount)
d: on /d type user (binmode,noumount)</PRE
></TD
></TR
></TABLE
></DIV
><P
>Note that <B
CLASS="COMMAND"
>mount</B
> was invoked from the Windows
command shell in the previous example.  In many Unix shells, including
bash, it is legal and convenient to use the forward "/" in Win32
pathnames since the "\" is the shell's escape character. </P
><P
>The <TT
CLASS="LITERAL"
>-s</TT
> flag to <B
CLASS="COMMAND"
>mount</B
> is used to add a mount
in the system-wide mount table used by all Cygwin users on the system,
instead of the user-specific one.  System-wide mounts are displayed
by <B
CLASS="COMMAND"
>mount</B
> as being of the "system" type, as is the
case for the <TT
CLASS="FILENAME"
>/</TT
> partition in the last example.
Under Windows NT, only those users with Administrator priviledges are
permitted to modify the system-wide mount table.</P
><P
>Note that a given POSIX path may only exist once in the user
table and once in the global, system-wide table.  Attempts to replace
the mount will fail with a busy error.  The <TT
CLASS="LITERAL"
>-f</TT
> (force) flag causes
the old mount to be silently replaced with the new one.  It will also
silence warnings about the non-existence of directories at the Win32
path location.</P
><P
>The <TT
CLASS="LITERAL"
>-b</TT
> flag is used to instruct Cygwin to treat binary and
text files in the same manner by default.  Binary mode mounts are
marked as "binmode" in the Flags column of <B
CLASS="COMMAND"
>mount</B
>
output.  By default, mounts are in text mode ("textmode" in the Flags
column).</P
><P
>Normally, files ending in certain extensions (.exe, .com, .bat, .cmd) 
are assumed to be executable.  Files whose first two characters begin with 
'#!' are also considered to be executable.  
The <TT
CLASS="LITERAL"
>-x</TT
> flag is used to instruct Cygwin that the 
mounted file is "executable".  If the <TT
CLASS="LITERAL"
>-x</TT
> flag is used 
with a directory then all files in the directory are executable.  
This option allows other files to be marked as executable and avoids the 
overhead of opening each file to check for a '#!'.  The <TT
CLASS="LITERAL"
>-X</TT
>
option is very similar to <TT
CLASS="LITERAL"
>-x</TT
>, but also prevents Cygwin
from setting up commands and environment variables for a normal Windows 
program, adding another small performance gain.  The opposite of these 
flags is the <TT
CLASS="LITERAL"
>-E</TT
> flag, which means that no files should be 
marked as executable.  </P
><P
>The <TT
CLASS="LITERAL"
>-m</TT
> option causes the <B
CLASS="COMMAND"
>mount</B
> utility
to output a series of commands that could recreate both user and system mount 
points. You can save this output as a backup when experimenting with the
mount table. It also makes moving your settings to a different machine
much easier.</P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN1094"
></A
>Cygdrive mount points</H3
><P
>Whenever Cygwin cannot use any of the existing mounts to convert
from a particular Win32 path to a POSIX one, Cygwin will, instead,
convert to a POSIX path using a default mount point:
<TT
CLASS="FILENAME"
>/cygdrive</TT
>.  For example, if Cygwin accesses
<TT
CLASS="FILENAME"
>z:\foo</TT
> and the z drive is not currently in the
mount table, then <TT
CLASS="FILENAME"
>z:\</TT
> will be accessible as
<TT
CLASS="FILENAME"
>/cygdrive/z</TT
>.  The <B
CLASS="COMMAND"
>mount</B
> utility 
can be used to change this default automount prefix through the use of the
"--change-cygdrive-prefix" option.  In the following example, we will
set the automount prefix to <TT
CLASS="FILENAME"
>/</TT
>:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1103"
></A
><P
><B
>Example 10. Changing the default prefix</B
></P
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
><TT
CLASS="PROMPT"
>c:\cygwin\&#62;</TT
> <TT
CLASS="USERINPUT"
><B
>mount --change-cygdrive-prefix /</B
></TT
></PRE
></TD
></TR
></TABLE
></DIV
><P
>Note that you if you set a new prefix in this manner, you can
specify the <TT
CLASS="LITERAL"
>-s</TT
> flag to make this the system-wide default 
prefix.  By default, the cygdrive-prefix applies only to the current user.  
You can always see the user and system cygdrive prefixes with the 
<TT
CLASS="LITERAL"
>-p</TT
> option.  Using the <TT
CLASS="LITERAL"
>-b</TT
>
flag with <TT
CLASS="LITERAL"
>--change-cygdrive-prefix</TT
> makes all new 
automounted filesystems default to binary mode file accesses.</P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN1113"
></A
>Limitations</H3
><P
>Limitations: there is a hard-coded limit of 30 mount
points.  Also, although you can mount to pathnames that do not start
with "/", there is no way to make use of such mount points.</P
><P
>Normally the POSIX mount point in Cygwin is an existing empty
directory, as in standard UNIX. If this is the case, or if there is a
place-holder for the mount point (such as a file, a symbolic link
pointing anywhere, or a non-empty directory), you will get the expected
behavior. Files present in a mount point directory before the mount
become invisible to Cygwin programs.</P
><P
>It is sometimes desirable to mount to a non-existent directory,
for example to avoid cluttering the root directory with names
such as
<TT
CLASS="FILENAME"
>a</TT
>, <TT
CLASS="FILENAME"
>b</TT
>, <TT
CLASS="FILENAME"
>c</TT
>
pointing to disks.
Although <B
CLASS="COMMAND"
>mount</B
> will give you a warning, most
everything will work properly when you refer to the mount point
explicitly.  Some strange effects can occur however.
For example if your current working directory is
<TT
CLASS="FILENAME"
>/dir</TT
>,
say, and <TT
CLASS="FILENAME"
>/dir/mtpt</TT
> is a mount point, then
<TT
CLASS="FILENAME"
>mtpt</TT
> will not show up in an <B
CLASS="COMMAND"
>ls</B
>
or
<B
CLASS="COMMAND"
>echo *</B
> command and <B
CLASS="COMMAND"
>find .</B
> will
not
find <TT
CLASS="FILENAME"
>mtpt</TT
>.</P
></DIV
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="PASSWD"
></A
>passwd</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: passwd (-l|-u|-S) [USER]
       passwd [-i NUM] [-n MINDAYS] [-x MAXDAYS] [-L LEN]

User operations:
 -l, --lock      lock USER's account
 -u, --unlock    unlock USER's account
 -S, --status    display password status for USER (locked, expired, etc.)

System operations:
 -i, --inactive  set NUM of days before inactive accounts are disabled
                 (inactive accounts are those with expired passwords)
 -n, --minage    set system minimum password age to MINDAYS
 -x, --maxage    set system maximum password age to MAXDAYS
 -L, --length    set system minimum password length to LEN

Other options:
 -h, --help      output usage information and exit
 -v, --version   output version information and exit</PRE
></TD
></TR
></TABLE
><P
> <B
CLASS="COMMAND"
>passwd</B
> changes passwords for user accounts.
A normal user may only change the password for their own account,
but administrators may change passwords on any account.
<B
CLASS="COMMAND"
>passwd</B
> also changes account information, such as
password expiry dates and intervals.</P
><P
>Password changes: The user is first prompted for their old
password, if one is present.  This password is then encrypted and
compared against the stored password.  The user has only one chance to
enter the correct password.  The administrators are permitted to
bypass this step so that forgotten passwords may be changed.</P
><P
>The user is then prompted for a replacement password.
<B
CLASS="COMMAND"
>passwd</B
> will prompt twice for this replacement and 
compare the second entry against the first.  Both entries are require to 
match in order for the password to be changed.</P
><P
>After the password has been entered, password aging information
is checked to see if the user is permitted to change their password
at this time.  If not, <B
CLASS="COMMAND"
>passwd</B
> refuses to change the
password and exits.</P
><P
>Account maintenance: User accounts may be locked and unlocked with the
<TT
CLASS="LITERAL"
>-l</TT
> and <TT
CLASS="LITERAL"
>-u</TT
> flags.  The
<TT
CLASS="LITERAL"
>-l</TT
> option disables an account.  The <TT
CLASS="LITERAL"
>-u</TT
>
option re-enables an account.</P
><P
>The account status may be given with the <TT
CLASS="LITERAL"
>-S</TT
>
option.  The status information is self explanatory.</P
><P
>Administrators can also use <B
CLASS="COMMAND"
>passwd</B
> to change
system-wide password expiry and length requirements with the
<TT
CLASS="LITERAL"
>-i</TT
>, <TT
CLASS="LITERAL"
>-n</TT
>, <TT
CLASS="LITERAL"
>-x</TT
>,
and <TT
CLASS="LITERAL"
>-L</TT
> options.  The <TT
CLASS="LITERAL"
>-i</TT
>
option is used to disable an account after the password has been expired
for a number of days.  After a user account has had an expired password
for <I
CLASS="EMPHASIS"
>NUM</I
> days, the user may no longer sign on to
the account.  The <TT
CLASS="LITERAL"
>-n</TT
> option is
used to set the minimum number of days before a password may be changed.
The user will not be permitted to change the password until
<I
CLASS="EMPHASIS"
>MINDAYS</I
> days have elapsed.  The
<TT
CLASS="LITERAL"
>-x</TT
> option is used to set the maximum number of days
a password remains valid.  After <I
CLASS="EMPHASIS"
>MAXDAYS</I
> days, the
password is required to be changed.  Allowed values for the above options 
are 0 to 999.  The <TT
CLASS="LITERAL"
>-L</TT
> option sets the minimum length of 
allowed passwords for users who don't belong to the administrators group
to <I
CLASS="EMPHASIS"
>LEN</I
> characters.  Allowed values for the minimum
password length are 0 to 14.  In any of the above cases, a value of 0
means `no restrictions'.</P
><P
>Limitations: Users may not be able to change their password on
some systems.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="PS"
></A
>ps</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: ps [-aefls] [-u UID]
 -a, --all       show processes of all users
 -e, --everyone  show processes of all users
 -f, --full      show process uids, ppids
 -h, --help      output usage information and exit
 -l, --long      show process uids, ppids, pgids, winpids
 -s, --summary   show process summary
 -u, --user      list processes owned by UID
 -v, --version   output version information and exit
 -W, --windows   show windows as well as cygwin processes
With no options, ps outputs the long format by default</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>ps</B
> program gives the status of all the
Cygwin processes running on the system (ps = "process status").  Due
to the limitations of simulating a POSIX environment under Windows,
there is little information to give.  </P
><P
>The PID column is the process ID you need to give to the 
<B
CLASS="COMMAND"
>kill</B
> command. The PPID is the parent process ID,
and PGID is the process group ID.  The WINPID column is the process 
ID displayed by NT's Task Manager program. The TTY column gives which 
pseudo-terminal a process is running on, or a <TT
CLASS="LITERAL"
>'?'</TT
>
for services. The UID column shows which user owns each process. 
STIME is the time the process was started, and COMMAND gives the name
of the program running.</P
><P
>By default <B
CLASS="COMMAND"
>ps</B
> will only show processes owned by the
current user. With either the <TT
CLASS="LITERAL"
>-a</TT
> or <TT
CLASS="LITERAL"
>-e</TT
>
option, all user's processes (and system processes) are listed. There are
historical UNIX reasons for the synonomous options, which are functionally
identical. The <TT
CLASS="LITERAL"
>-f</TT
> option outputs a "full" listing with
usernames for UIDs. The <TT
CLASS="LITERAL"
>-l</TT
> option is the default display
mode, showing a "long" listing with all the above columns. The other display
option is <TT
CLASS="LITERAL"
>-s</TT
>, which outputs a shorter listing of just
PID, TTY, STIME, and COMMAND. The <TT
CLASS="LITERAL"
>-u</TT
> option allows you
to show only processes owned by a specific user. The <TT
CLASS="LITERAL"
>-W</TT
>
option causes <B
CLASS="COMMAND"
>ps</B
> show non-Cygwin Windows processes as 
well as Cygwin processes. The WINPID is also the PID, and they can be killed
with the Cygwin <B
CLASS="COMMAND"
>kill</B
> command's <TT
CLASS="LITERAL"
>-f</TT
>
option.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="REGTOOL"
></A
>regtool</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: regtool.exe [OPTION] (add | check | get | list | remove | unset) KEY

Actions:
 add KEY\SUBKEY             add new SUBKEY
 check KEY                  exit 0 if KEY exists, 1 if not
 get KEY\VALUE              prints VALUE to stdout
 list KEY                   list SUBKEYs and VALUEs
 remove KEY                 remove KEY
 set KEY\VALUE [data ...]   set VALUE
 unset KEY\VALUE            removes VALUE from KEY

Options for 'list' Action:
 -k, --keys           print only KEYs
 -l, --list           print only VALUEs
 -p, --postfix        like ls -p, appends '\' postfix to KEY names

Options for 'set' Action:
 -e, --expand-string  set type to REG_EXPAND_SZ
 -i, --integer        set type to REG_DWORD
 -m, --multi-string   set type to REG_MULTI_SZ
 -s, --string         set type to REG_SZ

Options for 'set' and 'unset' Actions:
 -K&#60;c&#62;, --key-separator[=]&#60;c&#62;  set key separator to &#60;c&#62; instead of '\'

Other Options:
 -h, --help     output usage information and exit
 -q, --quiet    no error output, just nonzero return if KEY/VALUE missing
 -v, --verbose  verbose output, including VALUE contents when applicable
 -V, --version  output version information and exit

KEY is in the format [host]\prefix\KEY\KEY\VALUE, where host is optional
remote host in either \\hostname or hostname: format and prefix is any of:
  root     HKCR  HKEY_CLASSES_ROOT (local only)
  config   HKCC  HKEY_CURRENT_CONFIG (local only)
  user     HKCU  HKEY_CURRENT_USER (local only)
  machine  HKLM  HKEY_LOCAL_MACHINE
  users    HKU   HKEY_USERS

You can use forward slash ('/') as a separator instead of backslash, in
that case backslash is treated as escape character
Example: regtool.exe get '\user\software\Microsoft\Clock\iFormat'</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>regtool</B
> program allows shell scripts
to access and modify the Windows registry.  Note that modifying the
Windows registry is dangerous, and carelessness here can result
in an unusable system.  Be careful.</P
><P
>The <TT
CLASS="LITERAL"
>-v</TT
> option means "verbose".  For most
commands, this causes additional or lengthier messages to be printed.
Conversely, the <TT
CLASS="LITERAL"
>-q</TT
> option supresses error messages,
so you can use the exit status of the program to detect if a key
exists or not (for example).</P
><P
>You must provide <B
CLASS="COMMAND"
>regtool</B
> with an 
<I
CLASS="EMPHASIS"
>action</I
> following options (if any). Currently,
the action must be <TT
CLASS="LITERAL"
>add</TT
>, <TT
CLASS="LITERAL"
>set</TT
>,
<TT
CLASS="LITERAL"
>check</TT
>, <TT
CLASS="LITERAL"
>get</TT
>, <TT
CLASS="LITERAL"
>list</TT
>,
<TT
CLASS="LITERAL"
>remove</TT
>, <TT
CLASS="LITERAL"
>set</TT
>, or <TT
CLASS="LITERAL"
>unset</TT
>.</P
><P
>The <TT
CLASS="LITERAL"
>add</TT
> action adds a new key.  The 
<TT
CLASS="LITERAL"
>check</TT
> action checks to see if a key exists (the 
exit code of the program is zero if it does, nonzero if it does not).
The <TT
CLASS="LITERAL"
>get</TT
> action gets the value of a value of a key,
and prints it (and nothing else) to stdout.  Note: if the value
doesn't exist, an error message is printed and the program returns a
non-zero exit code.  If you give <TT
CLASS="LITERAL"
>-q</TT
>, it doesn't
print the message but does return the non-zero exit code.</P
><P
>The <TT
CLASS="LITERAL"
>list</TT
> action lists the subkeys and values
belonging to the given key. With <TT
CLASS="LITERAL"
>list</TT
>, the 
<TT
CLASS="LITERAL"
>-k</TT
> option instructs <B
CLASS="COMMAND"
>regtool</B
>
to print only KEYs, and the <TT
CLASS="LITERAL"
>-l</TT
> option to print
only VALUEs. The <TT
CLASS="LITERAL"
>-p</TT
> option postfixes a 
<TT
CLASS="LITERAL"
>'/'</TT
> to each KEY, but leave VALUEs with no
postfix.  The <TT
CLASS="LITERAL"
>remove</TT
> action 
removes a key.  Note that you may need to remove everything in the key 
before you may remove it, but don't rely on this stopping you from 
accidentally removing too much.  </P
><P
>The <TT
CLASS="LITERAL"
>set</TT
> action sets a value within a key.
<TT
CLASS="LITERAL"
>-e</TT
> means it's an expanding string (REG_EXPAND_SZ)
that contains embedded environment variables.  
<TT
CLASS="LITERAL"
>-i</TT
> means the value is an integer (REG_DWORD).
<TT
CLASS="LITERAL"
>-m</TT
> means it's a multi-string (REG_MULTI_SZ).  
<TT
CLASS="LITERAL"
>-s</TT
> means the value is a string (REG_SZ).
If you don't specify one of these, <B
CLASS="COMMAND"
>regtool</B
> tries to
guess the type based on the value you give.  If it looks like a
number, it's a DWORD.  If it starts with a percent, it's an expanding
string.  If you give multiple values, it's a multi-string.  Else, it's
a regular string.
The <TT
CLASS="LITERAL"
>unset</TT
> action removes a value from a key.</P
><P
>By default, the last "\" or "/" is assumed to be the separator between the
key and the value.  You can use the <TT
CLASS="LITERAL"
>-K</TT
> option to provide 
an alternate key/value separator character.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="SETFACL"
></A
>setfacl</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: setfacl [-r] (-f ACL_FILE | -s acl_entries) FILE...
       setfacl [-r] ([-d acl_entries] [-m acl_entries]) FILE...

Modify file and directory access control lists (ACLs)

  -d, --delete     delete one or more specified ACL entries
  -f, --file       set ACL entries for FILE to ACL entries read
                   from a ACL_FILE
  -m, --modify     modify one or more specified ACL entries
  -r, --replace    replace mask entry with maximum permissions
                   needed for the file group class
  -s, --substitute substitute specified ACL entries for the
                   ACL of FILE
  -h, --help       output usage information and exit
  -v, --version    output version information and exit

At least one of (-d, -f, -m, -s) must be specified</PRE
></TD
></TR
></TABLE
><P
>For each file given as parameter, <B
CLASS="COMMAND"
>setfacl</B
> will 
either replace its complete ACL (<TT
CLASS="LITERAL"
>-s</TT
>, <TT
CLASS="LITERAL"
>-f</TT
>), 
or it will add, modify, or delete ACL entries.
For more information on Cygwin and Windows ACLs, see
see <A
HREF="ntsec.html"
>the Section called <I
>NT security and the <TT
CLASS="LITERAL"
>ntsec</TT
> usage</I
> in the chapter called <I
>Setting Up Cygwin</I
></A
> in the Cygwin User's Guide.</P
><P
>Acl_entries are one or more comma-separated ACL entries 
from the following list:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>         u[ser]::perm
         u[ser]:uid:perm
         g[roup]::perm
         g[roup]:gid:perm
         m[ask]::perm
         o[ther]::perm</PRE
></TD
></TR
></TABLE
>
Default entries are like the above with the additional
default identifier. For example: 
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>         d[efault]:u[ser]:uid:perm</PRE
></TD
></TR
></TABLE
></P
><P
><I
CLASS="EMPHASIS"
>perm</I
> is either a 3-char permissions string in the form
"rwx" with the character <TT
CLASS="LITERAL"
>'-'</TT
> for no permission
or it is the octal representation of the permissions, a
value from 0 (equivalent to "---") to 7 ("rwx").
<I
CLASS="EMPHASIS"
>uid</I
> is a user name or a numerical uid.
<I
CLASS="EMPHASIS"
>gid</I
> is a group name or a numerical gid.</P
><P
>The following options are supported:</P
><P
><TT
CLASS="LITERAL"
>-d</TT
>
Delete one or more specified entries from the file's ACL.
The owner, group and others entries must not be deleted.
Acl_entries to be deleted should be specified without
permissions, as in the following list:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>         u[ser]:uid
         g[roup]:gid
         d[efault]:u[ser]:uid
         d[efault]:g[roup]:gid
         d[efault]:m[ask]:
         d[efault]:o[ther]:</PRE
></TD
></TR
></TABLE
></P
><P
><TT
CLASS="LITERAL"
>-f</TT
>
Take the Acl_entries from ACL_FILE one per line. Whitespace
characters are ignored, and the character "#" may be used
to start a comment.  The special filename "-" indicates
reading from stdin. Note that you can use this with 
<B
CLASS="COMMAND"
>getfacl</B
> and <B
CLASS="COMMAND"
>setfacl</B
> to copy 
ACLs from one file to another:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>$ getfacl source_file | setfacl -f - target_file</PRE
></TD
></TR
></TABLE
></P
><P
>Required entries are: 
one user entry for the owner of the file,
one group entry for the group of the file, and
one other entry.</P
><P
>If additional user and group entries are given:
a mask entry for the file group class of the file, and 
no duplicate user or group entries with the same uid/gid.</P
><P
>If it is a directory:
one default user entry for the owner of the file,
one default group entry for the group of the file,
one default mask entry for the file group class, and
one default other entry.</P
><P
><TT
CLASS="LITERAL"
>-m</TT
>
Add or modify one or more specified ACL entries.  Acl_entries is a 
comma-separated list of entries from the same list as above.</P
><P
><TT
CLASS="LITERAL"
>-r</TT
>   
Causes the permissions specified in the mask 
entry to be ignored and replaced by the maximum permissions needed for 
the file group class.</P
><P
><TT
CLASS="LITERAL"
>-s</TT
>   
Like <TT
CLASS="LITERAL"
>-f</TT
>, but substitute the 
file's ACL with Acl_entries specified in a comma-separated list on the 
command line.</P
><P
>While the <TT
CLASS="LITERAL"
>-d</TT
> and <TT
CLASS="LITERAL"
>-m</TT
> options may be used 
in the same command, the <TT
CLASS="LITERAL"
>-f</TT
> and <TT
CLASS="LITERAL"
>-s</TT
> 
options may be used only exclusively.</P
><P
>Directories may contain default ACL entries.  Files created
in a directory that contains default ACL entries will have
permissions according to the combination of the current umask,
the explicit permissions requested and the default ACL entries</P
><P
>Limitations: Under Cygwin, the default ACL entries are not taken into
account currently.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="SSP"
></A
>ssp</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: ssp [options] low_pc high_pc command...
 -c, --console-trace  trace every EIP value to the console. *Lots* slower.
 -d, --disable        disable single-stepping by default; use
                      OutputDebugString ("ssp on") to enable stepping
 -e, --enable         enable single-stepping by default; use
                      OutputDebugString ("ssp off") to disable stepping
 -h, --help           output usage information and exit
 -l, --dll            enable dll profiling.  A chart of relative DLL usage
                      is produced after the run.
 -s, --sub-threads    trace sub-threads too.  Dangerous if you have
                      race conditions.
 -t, --trace-eip      trace every EIP value to a file TRACE.SSP.  This
                      gets big *fast*.
 -v, --verbose        output verbose messages about debug events.
 -V, --version        output version information and exit

Example: ssp 0x401000 0x403000 hello.exe</PRE
></TD
></TR
></TABLE
><P
>SSP - The Single Step Profiler</P
><P
>Original Author:  DJ Delorie </P
><P
>The SSP is a program that uses the Win32 debug API to run a program
one ASM instruction at a time.  It records the location of each
instruction used, how many times that instruction is used, and all
function calls.  The results are saved in a format that is usable by
the profiling program <B
CLASS="COMMAND"
>gprof</B
>, although 
<B
CLASS="COMMAND"
>gprof</B
> will claim the values
are seconds, they really are instruction counts.  More on that later.</P
><P
>Because the SSP was originally designed to profile the cygwin DLL, it
does not automatically select a block of code to report statistics on.
You must specify the range of memory addresses to keep track of
manually, but it's not hard to figure out what to specify.  Use the
"objdump" program to determine the bounds of the target's ".text"
section.  Let's say we're profiling cygwin1.dll.  Make sure you've
built it with debug symbols (else <B
CLASS="COMMAND"
>gprof</B
> won't run) 
and run objdump like this:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>$ objdump -h cygwin1.dll</PRE
></TD
></TR
></TABLE
>

It will print a report like this:
<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>cygwin1.dll:     file format pei-i386

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .text         0007ea00  61001000  61001000  00000400  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, CODE, DATA
  1 .data         00008000  61080000  61080000  0007ee00  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  . . .</PRE
></TD
></TR
></TABLE
></P
><P
>The only information we're concerned with are the VMA of 
the .text section and the VMA of the section after it 
(sections are usually contiguous; you can also add the 
Size to the VMA to get the end address).  In this case, 
the VMA is 0x61001000 and the ending address is either 
0x61080000 (start of .data method) or 0x0x6107fa00 (VMA+Size
method).</P
><P
>There are two basic ways to use SSP - either profiling a whole
program, or selectively profiling parts of the program.</P
><P
>To profile a whole program, just run <B
CLASS="COMMAND"
>ssp</B
> without options.  
By default, it will step the whole program.  Here's a simple example, using 
the numbers above:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>$ ssp 0x61001000 0x61080000 hello.exe</PRE
></TD
></TR
></TABLE
>

This will step the whole program.  It will take at least 8 minutes on
a PII/300 (yes, really).  When it's done, it will create a file called
"gmon.out".  You can turn this data file into a readable report with
<B
CLASS="COMMAND"
>gprof</B
>:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>$ gprof -b cygwin1.dll</PRE
></TD
></TR
></TABLE
>

The "-b" means 'skip the help pages'.  You can omit this until you're
familiar with the report layout.  The <B
CLASS="COMMAND"
>gprof</B
> documentation 
explains a lot about this report, but <B
CLASS="COMMAND"
>ssp</B
> changes a few 
things.  For example, the first part of the report reports the amount of time 
spent in each function, like this:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Each sample counts as 0.01 seconds.
  %   cumulative   self              self     total
 time   seconds   seconds    calls  ms/call  ms/call  name
 10.02    231.22    72.43       46  1574.57  1574.57  strcspn
  7.95    288.70    57.48      130   442.15   442.15  strncasematch</PRE
></TD
></TR
></TABLE
>

The "seconds" columns are really CPU opcodes, 1/100 second per opcode.
So, "231.22" above means 23,122 opcodes.  The ms/call values are 10x
too big; 1574.57 means 157.457 opcodes per call.  Similar adjustments
need to be made for the "self" and "children" columns in the second
part of the report.</P
><P
>OK, so now we've got a huge report that took a long time to generate,
and we've identified a spot we want to work on optimizing.  Let's say
it's the time() function.  We can use SSP to selectively profile this
function by using OutputDebugString() to control SSP from within the
program.  Here's a sample program:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>	#include &#60;windows.h&#62;
	main()
	{
	  time_t t;
	  OutputDebugString("ssp on");
	  time(&#38;t);
	  OutputDebugString("ssp off");
	}</PRE
></TD
></TR
></TABLE
></P
><P
>Then, add the <TT
CLASS="LITERAL"
>-d</TT
> option to ssp to default to 
*disabling* profiling.  The program will run at full speed until the first 
OutputDebugString, then step until the second.
You can then use <B
CLASS="COMMAND"
>gprof</B
> (as usual) to see the performance 
profile for just that portion of the program's execution.</P
><P
>There are many options to ssp.  Since step-profiling makes your
program run about 1,000 times slower than normal, it's best to
understand all the options so that you can narrow down the parts
of your program you need to single-step.</P
><P
><TT
CLASS="LITERAL"
>-v</TT
> - verbose.  This prints messages about threads 
starting and stopping, OutputDebugString calls, DLLs loading, etc.</P
><P
><TT
CLASS="LITERAL"
>-t</TT
> and <TT
CLASS="LITERAL"
>-c</TT
> - tracing.  
With <TT
CLASS="LITERAL"
>-t</TT
>, *every* step's address is written
to the file "trace.ssp".  This can be used to help debug functions,
since it can trace multiple threads.  Clever use of scripts can match
addresses with disassembled opcodes if needed.  Warning: creates
*huge* files, very quickly.  <TT
CLASS="LITERAL"
>-c</TT
> prints each address to 
the console, useful for debugging key chunks of assembler.  Use 
<TT
CLASS="LITERAL"
>addr2line -C -f -s -e foo.exe &#60; trace.ssp &#62; lines.ssp</TT
>
and then <TT
CLASS="LITERAL"
>perl cvttrace</TT
> to convert to symbolic traces.</P
><P
><TT
CLASS="LITERAL"
>-s</TT
> - subthreads.  Usually, you only need to trace the 
main thread, but sometimes you need to trace all threads, so this enables that.
It's also needed when you want to profile a function that only a
subthread calls.  However, using OutputDebugString automatically
enables profiling on the thread that called it, not the main thread.</P
><P
><TT
CLASS="LITERAL"
>-l</TT
> - dll profiling.  Generates a pretty table of how much 
time was spent in each dll the program used.  No sense optimizing a function in
your program if most of the time is spent in the DLL.
I usually use the <TT
CLASS="LITERAL"
>-v</TT
>, <TT
CLASS="LITERAL"
>-s</TT
>, and 
<TT
CLASS="LITERAL"
>-l</TT
> options:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>$ ssp <TT
CLASS="LITERAL"
>-v</TT
> <TT
CLASS="LITERAL"
>-s</TT
> <TT
CLASS="LITERAL"
>-l</TT
> <TT
CLASS="LITERAL"
>-d</TT
> 0x61001000 0x61080000 hello.exe</PRE
></TD
></TR
></TABLE
></P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="STRACE"
></A
>strace</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: strace.exe [OPTIONS] &#60;command-line&#62;
Usage: strace.exe [OPTIONS] -p &#60;pid&#62;
  -b, --buffer-size=SIZE       set size of output file buffer
  -d, --no-delta               don't display the delta-t microsecond timestamp
  -f, --trace-children         trace child processes (toggle - default true)
  -h, --help                   output usage information and exit
  -m, --mask=MASK              set message filter mask
  -n, --crack-error-numbers    output descriptive text instead of error
                               numbers for Windows errors
  -o, --output=FILENAME        set output file to FILENAME
  -p, --pid=n                  attach to executing program with cygwin pid n
  -S, --flush-period=PERIOD    flush buffered strace output every PERIOD secs
  -t, --timestamp              use an absolute hh:mm:ss timestamp insted of 
                               the default microsecond timestamp.  Implies -d
  -T, --toggle                 toggle tracing in a process already being
                               traced. Requires -p &#60;pid&#62;
  -v, --version                output version information and exit
  -w, --new-window             spawn program under test in a new window

    MASK can be any combination of the following mnemonics and/or hex values
    (0x is optional).  Combine masks with '+' or ',' like so:

                      --mask=wm+system,malloc+0x00800

    Mnemonic Hex     Corresponding Def  Description
    =========================================================================
    all      0x00001 (_STRACE_ALL)      All strace messages.
    flush    0x00002 (_STRACE_FLUSH)    Flush output buffer after each message.
    inherit  0x00004 (_STRACE_INHERIT)  Children inherit mask from parent.
    uhoh     0x00008 (_STRACE_UHOH)     Unusual or weird phenomenon.
    syscall  0x00010 (_STRACE_SYSCALL)  System calls.
    startup  0x00020 (_STRACE_STARTUP)  argc/envp printout at startup.
    debug    0x00040 (_STRACE_DEBUG)    Info to help debugging. 
    paranoid 0x00080 (_STRACE_PARANOID) Paranoid info.
    termios  0x00100 (_STRACE_TERMIOS)  Info for debugging termios stuff.
    select   0x00200 (_STRACE_SELECT)   Info on ugly select internals.
    wm       0x00400 (_STRACE_WM)       Trace Windows msgs (enable _strace_wm).
    sigp     0x00800 (_STRACE_SIGP)     Trace signal and process handling.
    minimal  0x01000 (_STRACE_MINIMAL)  Very minimal strace output.
    exitdump 0x04000 (_STRACE_EXITDUMP) Dump strace cache on exit.
    system   0x08000 (_STRACE_SYSTEM)   Serious error; goes to console and log.
    nomutex  0x10000 (_STRACE_NOMUTEX)  Don't use mutex for synchronization.
    malloc   0x20000 (_STRACE_MALLOC)   Trace malloc calls.
    thread   0x40000 (_STRACE_THREAD)   Thread-locking calls.</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>strace</B
> program executes a program, and
optionally the children of the program, reporting any Cygwin DLL output
from the program(s) to stdout, or to a file with the <TT
CLASS="LITERAL"
>-o</TT
>
option.  With the <TT
CLASS="LITERAL"
>-w</TT
> option, you can start an strace
session in a new window, for example:

<TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>$ strace -o tracing_output -w sh -c 'while true; do echo "tracing..."; done' &#38;</PRE
></TD
></TR
></TABLE
>
This is particularly useful for <B
CLASS="COMMAND"
>strace</B
> sessions that
take a long time to complete.</P
><P
>Note that <B
CLASS="COMMAND"
>strace</B
> is a standalone Windows program and so does 
not rely on the Cygwin DLL itself (you can verify this with 
<B
CLASS="COMMAND"
>cygcheck</B
>). As a result it does not understand POSIX
pathnames or symlinks.  This program is mainly useful for debugging the 
Cygwin DLL itself.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="UMOUNT"
></A
>umount</H2
><TABLE
BORDER="0"
BGCOLOR="#E0E0E0"
WIDTH="100%"
><TR
><TD
><PRE
CLASS="SCREEN"
>Usage: umount.exe [OPTION] [&#60;posixpath&#62;]
  -A, --remove-all-mounts       remove all mounts
  -c, --remove-cygdrive-prefix  remove cygdrive prefix
  -h, --help                    output usage information and exit
  -s, --system                  remove system mount (default)
  -S, --remove-system-mounts    remove all system mounts
  -u, --user                    remove user mount
  -U, --remove-user-mounts      remove all user mounts
  -v, --version                 output version information and exit</PRE
></TD
></TR
></TABLE
><P
>The <B
CLASS="COMMAND"
>umount</B
> program removes mounts from the
mount table.  If you specify a POSIX path that corresponds to a
current mount point, <B
CLASS="COMMAND"
>umount</B
> will remove it from the
system registry area.  (Administrator priviledges are required).
The <TT
CLASS="LITERAL"
>-u</TT
> flag may be used to specify removing the mount 
from the user-specific registry area instead.</P
><P
>The <B
CLASS="COMMAND"
>umount</B
> utility may also be used to remove
all mounts of a particular type.  With the extended options it is
possible to remove all mounts (<TT
CLASS="LITERAL"
>-A</TT
>), all 
cygdrive automatically-mounted mounts (<TT
CLASS="LITERAL"
>-c</TT
>), all
mounts in the current user's registry area (<TT
CLASS="LITERAL"
>-U</TT
>), 
or all mounts in the system-wide registry area (<TT
CLASS="LITERAL"
>-S</TT
>) 
(with Administrator privileges).</P
><P
>See <A
HREF="using-utils.html#MOUNT"
>the Section called <I
>mount</I
></A
> for more information on the mount
table.</P
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="using-cygwinenv.html"
ACCESSKEY="P"
>&#60;&#60;&#60; Previous</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="cygwin-ug-net.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="programming.html"
ACCESSKEY="N"
>Next &#62;&#62;&#62;</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>The <TT
CLASS="ENVAR"
>CYGWIN</TT
> environment
variable</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="using.html"
ACCESSKEY="U"
>Up</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Programming with Cygwin</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>