<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.01 Transitional//EN">
<HTML
><HEAD
><TITLE
>Cygwin Utilities</TITLE
><META
NAME="GENERATOR"
CONTENT="Modular DocBook HTML Stylesheet Version 1.7"><LINK
REL="HOME"
TITLE="Cygwin User's Guide"
HREF="cygwin-ug-net.html"><LINK
REL="UP"
TITLE="Using Cygwin"
HREF="using.html"><LINK
REL="PREVIOUS"
TITLE="The CYGWIN environment
variable"
HREF="using-cygwinenv.html"><LINK
REL="NEXT"
TITLE="Using Cygwin effectively with Windows"
HREF="using-effectively.html"><LINK
REL="STYLESHEET"
TYPE="text/css"
HREF="docbook.css"></HEAD
><BODY
CLASS="SECT1"
BGCOLOR="#FFFFFF"
TEXT="#000000"
LINK="#0000FF"
VLINK="#840084"
ALINK="#0000FF"
><DIV
CLASS="NAVHEADER"
><TABLE
SUMMARY="Header navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TH
COLSPAN="3"
ALIGN="center"
>Cygwin User's Guide</TH
></TR
><TR
><TD
WIDTH="10%"
ALIGN="left"
VALIGN="bottom"
><A
HREF="using-cygwinenv.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="80%"
ALIGN="center"
VALIGN="bottom"
>Chapter 3. Using Cygwin</TD
><TD
WIDTH="10%"
ALIGN="right"
VALIGN="bottom"
><A
HREF="using-effectively.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
></TABLE
><HR
ALIGN="LEFT"
WIDTH="100%"></DIV
><DIV
CLASS="SECT1"
><H1
CLASS="SECT1"
><A
NAME="USING-UTILS"
>Cygwin Utilities</A
></H1
><P
>Cygwin comes with a number of command-line utilities that are
used to manage the UNIX emulation portion of the Cygwin environment.
While many of these reflect their UNIX counterparts, each was written
specifically for Cygwin.  You may use the long or short option names 
interchangeably; for example, <VAR
CLASS="LITERAL"
>--help</VAR
> and 
<VAR
CLASS="LITERAL"
>-h</VAR
> function identically. All of the Cygwin 
command-line utilities support the <VAR
CLASS="LITERAL"
>--help</VAR
> and
<VAR
CLASS="LITERAL"
>--version</VAR
> options. </P
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="CYGCHECK"
>cygcheck</A
></H2
><PRE
CLASS="SCREEN"
>Usage: cygcheck [OPTIONS] [PROGRAM...]
Check system information or PROGRAM library dependencies

 -c, --check-setup   check packages installed via setup.exe
 -d, --dump-only     no integrity checking of package contents (requires -c)
 -s, --sysinfo       system information (not with -k)
 -v, --verbose       verbose output (indented) (for -[cfls] or programs)
 -r, --registry      registry search (requires -s)
 -k, --keycheck      perform a keyboard check session (not with -[scfl])
 -f, --find-package  find installed packages containing files (not with -[cl])
 -l, --list-package  list the contents of installed packages (not with -[cf])
 -h, --help          give help about the info (not with -[cfl])
 -V, --version       output version information and exit</PRE
><P
>The <B
CLASS="COMMAND"
>cygcheck</B
> program is a diagnostic utility for
dealing with Cygwin programs. If you are familiar with
<B
CLASS="COMMAND"
>dpkg</B
> or <B
CLASS="COMMAND"
>rpm</B
>,
<B
CLASS="COMMAND"
>cygcheck</B
> is similar in many ways. (The major difference
is that <B
CLASS="COMMAND"
>setup.exe</B
> handles installing and uninstalling
packages; see <A
HREF="setup-net.html#INTERNET-SETUP"
>the Section called <I
>Internet Setup</I
> in Chapter 2</A
> for more information.)</P
><P
>The <VAR
CLASS="LITERAL"
>-c</VAR
> option checks the version and status of 
installed Cygwin packages. If you specify one or more package names,
<B
CLASS="COMMAND"
>cygcheck</B
> will limit its output to those packages,
or with no arguments it lists all packages. A package will be marked
<VAR
CLASS="LITERAL"
>Incomplete</VAR
> if files originally installed are no longer
present. The best thing to do in that situation is reinstall the package
with <B
CLASS="COMMAND"
>setup.exe</B
>. To see which files are missing, use the
<VAR
CLASS="LITERAL"
>-v</VAR
> option. If you do not need to know the status
of each package and want <B
CLASS="COMMAND"
>cygcheck</B
> to run faster, add the
<VAR
CLASS="LITERAL"
>-d</VAR
> option and <B
CLASS="COMMAND"
>cygcheck</B
> will only
output the name and version for each package.</P
><P
>If you list one or more programs on the command line,
<B
CLASS="COMMAND"
>cygcheck</B
> will diagnose the runtime environment of that
program or programs, providing the names of DLL files on which the program
depends.  If you specify the <VAR
CLASS="LITERAL"
>-s</VAR
> option,
<B
CLASS="COMMAND"
>cygcheck</B
> will give general system information.  If you
list one or more programs on the command line and specify
<VAR
CLASS="LITERAL"
>-s</VAR
>, <B
CLASS="COMMAND"
>cygcheck</B
> will report on
both.</P
><P
>The <VAR
CLASS="LITERAL"
>-f</VAR
> option helps you to track down which package a
file came from, and <VAR
CLASS="LITERAL"
>-l</VAR
> lists all files in a package.
For example, to find out about <TT
CLASS="FILENAME"
>/usr/bin/less</TT
> and its
package:
<DIV
CLASS="EXAMPLE"
><A
NAME="AEN1047"
></A
><P
><B
>Example 3-3. Example <B
CLASS="COMMAND"
>cygcheck</B
> usage</B
></P
><PRE
CLASS="SCREEN"
>$ cygcheck.exe -f /usr/bin/less
less-381-1

$ cygcheck.exe -l less
/usr/bin/less.exe
/usr/bin/lessecho.exe
/usr/bin/lesskey.exe
/usr/man/man1/less.1
/usr/man/man1/lesskey.1</PRE
></DIV
></P
><P
>The <VAR
CLASS="LITERAL"
>-h</VAR
> option prints additional helpful
messages in the report, at the beginning of each section.  It also
adds table column headings.  While this is useful information, it also
adds some to the size of the report, so if you want a compact report
or if you know what everything is already, just leave this out.</P
><P
>The <VAR
CLASS="LITERAL"
>-v</VAR
> option causes the output to be more
verbose.  What this means is that additional information will be
reported which is usually not interesting, such as the internal
version numbers of DLLs, additional information about recursive DLL
usage, and if a file in one directory in the PATH also occurs in other
directories on the PATH.  </P
><P
>The <VAR
CLASS="LITERAL"
>-r</VAR
> option causes
<B
CLASS="COMMAND"
>cygcheck</B
> to search your registry for information
that is relevent to Cygwin programs.  These registry entries are the
ones that have "Cygwin" in the name.  If you are paranoid about
privacy, you may remove information from this report, but please keep
in mind that doing so makes it harder to diagnose your problems.</P
><P
>The <B
CLASS="COMMAND"
>cygcheck</B
> program should be used to send
information about your system for troubleshooting when requested.  
When asked to run this command save the output so that you can email it,
for example:</P
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>C:\cygwin&gt;</SAMP
> <KBD
CLASS="USERINPUT"
>cygcheck -s -v -r -h &gt; cygcheck_output.txt</KBD
></PRE
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="CYGPATH"
>cygpath</A
></H2
><PRE
CLASS="SCREEN"
>Usage: cygpath (-d|-m|-u|-w|-t TYPE) [-c HANDLE] [-f FILE] [options] NAME
       cygpath [-ADHPSW] 
Convert Unix and Windows format paths, or output system path information

Output type options:
  -d, --dos             print DOS (short) form of NAME (C:\PROGRA~1\)
  -m, --mixed           like --windows, but with regular slashes (C:/WINNT)
  -M, --mode		report on mode of file (currently binmode or textmode)
  -u, --unix            (default) print Unix form of NAME (/cygdrive/c/winnt)
  -w, --windows         print Windows form of NAME (C:\WINNT)
  -t, --type TYPE       print TYPE form: 'dos', 'mixed', 'unix', or 'windows'
Path conversion options:
  -a, --absolute        output absolute path
  -l, --long-name       print Windows long form of NAME (with -w, -m only)
  -p, --path            NAME is a PATH list (i.e., '/bin:/usr/bin')
  -s, --short-name      print DOS (short) form of NAME (with -w, -m only)
System information:
  -A, --allusers        use `All Users' instead of current user for -D, -P
  -D, --desktop         output `Desktop' directory and exit
  -H, --homeroot        output `Profiles' directory (home root) and exit
  -P, --smprograms      output Start Menu `Programs' directory and exit
  -S, --sysdir          output system directory and exit
  -W, --windir          output `Windows' directory and exit</PRE
><P
>The <B
CLASS="COMMAND"
>cygpath</B
> program is a utility that
converts Windows native filenames to Cygwin POSIX-style pathnames and
vice versa.  It can be used when a Cygwin program needs to pass a file 
name to a native Windows program, or expects to get a file name from a
native Windows program.  Alternatively, <B
CLASS="COMMAND"
>cygpath</B
> can 
output information about the location of important system directories 
in either format.  </P
><P
>The <VAR
CLASS="LITERAL"
>-u</VAR
> and <VAR
CLASS="LITERAL"
>-w</VAR
> options
indicate whether you want a conversion to UNIX (POSIX) format 
(<VAR
CLASS="LITERAL"
>-u</VAR
>) or to Windows format (<VAR
CLASS="LITERAL"
>-w</VAR
>).  
Use the <VAR
CLASS="LITERAL"
>-d</VAR
> to get DOS-style (8.3) file and path names.
The <VAR
CLASS="LITERAL"
>-m</VAR
> option will output Windows-style format
but with forward slashes instead of backslashes.  This option is 
especially useful in shell scripts, which use backslashes as an escape 
character.</P
><P
> In combination with the <VAR
CLASS="LITERAL"
>-w</VAR
> option, you can use
the <VAR
CLASS="LITERAL"
>-l</VAR
> and <VAR
CLASS="LITERAL"
>-s</VAR
> options to use normal
(long) or DOS-style (short) form. The <VAR
CLASS="LITERAL"
>-d</VAR
> option is 
identical to <VAR
CLASS="LITERAL"
>-w</VAR
> and <VAR
CLASS="LITERAL"
>-s</VAR
> together.</P
><P
>Caveat: The <VAR
CLASS="LITERAL"
>-l</VAR
> option does not work if the
<SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>check_case</I
></SPAN
> parameter of <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>CYGWIN</I
></SPAN
> 
is set to <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>strict</I
></SPAN
>, since Cygwin is not able to match 
any Windows short path in this mode.</P
><P
>The <VAR
CLASS="LITERAL"
>-p</VAR
> option means that you want to convert
a path-style string rather than a single filename.  For example, the
PATH environment variable is semicolon-delimited in Windows, but
colon-delimited in UNIX.  By giving <VAR
CLASS="LITERAL"
>-p</VAR
> you are
instructing <B
CLASS="COMMAND"
>cygpath</B
> to convert between these
formats.</P
><P
>The <VAR
CLASS="LITERAL"
>-i</VAR
> option supresses the print out of the
usage message if no filename argument was given.  It can be used in
make file rules converting variables that may be omitted
to a proper format.  Note that <B
CLASS="COMMAND"
>cygpath</B
> output may 
contain spaces (C:\Program Files) so should be enclosed in quotes.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1095"
></A
><P
><B
>Example 3-4. Example <B
CLASS="COMMAND"
>cygpath</B
> usage</B
></P
><PRE
CLASS="SCREEN"
>#!/bin/sh
if [ "${1}" = "" ];
	then
		XPATH=".";
	else
		XPATH="$(cygpath -w "${1}")";
fi
explorer $XPATH &#38;</PRE
></DIV
><P
>The capital options 
<VAR
CLASS="LITERAL"
>-D</VAR
>, <VAR
CLASS="LITERAL"
>-H</VAR
>, <VAR
CLASS="LITERAL"
>-P</VAR
>, 
<VAR
CLASS="LITERAL"
>-S</VAR
>, and <VAR
CLASS="LITERAL"
>-W</VAR
> output directories used 
by Windows that are not the same on all systems, for example 
<VAR
CLASS="LITERAL"
>-S</VAR
> might output C:\WINNT\SYSTEM32 or C:\WINDOWS\SYSTEM. 
The <VAR
CLASS="LITERAL"
>-H</VAR
> shows the Windows profiles directory that can 
be used as root of home.  The <VAR
CLASS="LITERAL"
>-A</VAR
> option forces use of 
the "All Users" directories instead of the current user for the 
<VAR
CLASS="LITERAL"
>-D</VAR
> and <VAR
CLASS="LITERAL"
>-P</VAR
> options. 
On Win9x systems with only a single user, <VAR
CLASS="LITERAL"
>-A</VAR
> has no
effect; <VAR
CLASS="LITERAL"
>-D</VAR
> and <VAR
CLASS="LITERAL"
>-AD</VAR
> would have the
same output.  By default the output is in UNIX (POSIX) format; 
use the <VAR
CLASS="LITERAL"
>-w</VAR
> or <VAR
CLASS="LITERAL"
>-d</VAR
> options to get
other formats.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="DUMPER"
>dumper</A
></H2
><PRE
CLASS="SCREEN"
>Usage: dumper [OPTION] FILENAME WIN32PID
Dump core from WIN32PID to FILENAME.core

-d, --verbose  be verbose while dumping
-h, --help     output help information and exit
-q, --quiet    be quiet while dumping (default)
-v, --version  output version information and exit</PRE
><P
>The <B
CLASS="COMMAND"
>dumper</B
> utility can be used to create a
core dump of running Windows process. This core dump can be later loaded
to <B
CLASS="COMMAND"
>gdb</B
> and analyzed. One common way to use 
<B
CLASS="COMMAND"
>dumper</B
> is to plug it into cygwin's Just-In-Time 
debugging facility by adding

<PRE
CLASS="SCREEN"
>error_start=x:\path\to\dumper.exe</PRE
>

to the <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>CYGWIN</I
></SPAN
> environment variable. Please note that
<VAR
CLASS="LITERAL"
>x:\path\to\dumper.exe</VAR
> is Windows-style and not cygwin
path. If <VAR
CLASS="LITERAL"
>error_start</VAR
> is set this way, then dumper will
be started whenever some program encounters a fatal error.</P
><P
><B
CLASS="COMMAND"
>dumper</B
> can be also be started from the command line to 
create a core dump of any running process. Unfortunately, because of a Windows 
API limitation, when a core dump is created and <B
CLASS="COMMAND"
>dumper</B
> 
exits, the target process is terminated too.</P
><P
>To save space in the core dump, <B
CLASS="COMMAND"
>dumper</B
> doesn't write those
portions of target process' memory space that are loaded from executable and
dll files and are unchangeable, such as program code and debug info. Instead,
<B
CLASS="COMMAND"
>dumper</B
> saves paths to files which contain that data. When a
core dump is loaded into gdb, it uses these paths to load appropriate files.
That means that if you create a core dump on one machine and try to debug it on
another, you'll need to place identical copies of the executable and dlls in 
the same directories as on the machine where the core dump was created.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="GETFACL"
>getfacl</A
></H2
><PRE
CLASS="SCREEN"
>Usage: getfacl [-adn] FILE [FILE2...]
Display file and directory access control lists (ACLs).

  -a, --all      display the filename, the owner, the group, and
                 the ACL of the file
  -d, --dir      display the filename, the owner, the group, and
                 the default ACL of the directory, if it exists
  -h, --help     output usage information and exit
  -n, --noname   display user and group IDs instead of names
  -v, --version  output version information and exit

When multiple files are specified on the command line, a blank
line separates the ACLs for each file.</PRE
><P
>For each argument that is a regular file, special file or
directory, <B
CLASS="COMMAND"
>getfacl</B
> displays the owner, the group, and the 
ACL.  For directories <B
CLASS="COMMAND"
>getfacl</B
> displays additionally the 
default ACL.  With no options specified, <B
CLASS="COMMAND"
>getfacl</B
> displays 
the filename, the owner, the group, and both the ACL and the default ACL, if 
it exists. For more information on Cygwin and Windows ACLs, see
see <A
HREF="ntsec.html"
>the Section called <I
>NT security and the <VAR
CLASS="LITERAL"
>ntsec</VAR
> usage</I
> in Chapter 2</A
> in the Cygwin User's Guide.
The format for ACL output is as follows:
<PRE
CLASS="SCREEN"
>     # file: filename
     # owner: name or uid
     # group: name or uid
     user::perm
     user:name or uid:perm
     group::perm
     group:name or gid:perm
     mask:perm
     other:perm
     default:user::perm
     default:user:name or uid:perm
     default:group::perm
     default:group:name or gid:perm
     default:mask:perm
     default:other:perm</PRE
></P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="KILL"
>kill</A
></H2
><PRE
CLASS="SCREEN"
>Usage: kill [-f] [-signal] [-s signal] pid1 [pid2 ...]
       kill -l [signal]
Send signals to processes

 -f, --force     force, using win32 interface if necessary
 -l, --list      print a list of signal names
 -s, --signal    send signal (use kill --list for a list)
 -h, --help      output usage information and exit
 -v, --version   output version information and exit</PRE
><P
>The <B
CLASS="COMMAND"
>kill</B
> program allows you to send arbitrary
signals to other Cygwin programs.  The usual purpose is to end a
running program from some other window when ^C won't work, but you can
also send program-specified signals such as SIGUSR1 to trigger actions
within the program, like enabling debugging or re-opening log files.
Each program defines the signals they understand.</P
><P
>You may need to specify the full path to use <B
CLASS="COMMAND"
>kill</B
> 
from within some shells, including <B
CLASS="COMMAND"
>bash</B
>, the default Cygwin
shell. This is because <B
CLASS="COMMAND"
>bash</B
> defines a 
<B
CLASS="COMMAND"
>kill</B
> builtin function; see the <B
CLASS="COMMAND"
>bash</B
>
man page under <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>BUILTIN COMMANDS</I
></SPAN
> for more information.
To make sure you are using the Cygwin version, try

<PRE
CLASS="SCREEN"
>$ /bin/kill --version</PRE
>

which should give the Cygwin <B
CLASS="COMMAND"
>kill</B
> version number and
copyright information.</P
><P
>Unless you specific the <VAR
CLASS="LITERAL"
>-f</VAR
> option, the "pid" values 
used by <B
CLASS="COMMAND"
>kill</B
> are the Cygwin pids, not the Windows pids.  
To get a list of running programs and their Cygwin pids, use the Cygwin
<B
CLASS="COMMAND"
>ps</B
> program. <B
CLASS="COMMAND"
>ps -W</B
> will display
<SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>all</I
></SPAN
> windows pids.</P
><P
>The <B
CLASS="COMMAND"
>kill -l</B
> option prints the name of the
given signal, or a list of all signal names if no signal is given.</P
><P
>To send a specific signal, use the <VAR
CLASS="LITERAL"
>-signN</VAR
>
option, either with a signal number or a signal name (minus the "SIG"
part), like these examples:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1165"
></A
><P
><B
>Example 3-5. Using the kill command</B
></P
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>$</SAMP
> <KBD
CLASS="USERINPUT"
>kill 123</KBD
>
<SAMP
CLASS="PROMPT"
>$</SAMP
> <KBD
CLASS="USERINPUT"
>kill -1 123</KBD
>
<SAMP
CLASS="PROMPT"
>$</SAMP
> <KBD
CLASS="USERINPUT"
>kill -HUP 123</KBD
>
<SAMP
CLASS="PROMPT"
>$</SAMP
> <KBD
CLASS="USERINPUT"
>kill -f 123</KBD
></PRE
></DIV
><P
>Here is a list of available signals, their numbers, and some
commentary on them, from the file
<VAR
CLASS="LITERAL"
>&lt;sys/signal.h&gt;</VAR
>, which should be considered
the official source of this information.</P
><PRE
CLASS="SCREEN"
>SIGHUP       1    hangup
SIGINT       2    interrupt
SIGQUIT      3    quit
SIGILL       4    illegal instruction (not reset when caught)
SIGTRAP      5    trace trap (not reset when caught)
SIGABRT      6    used by abort
SIGEMT       7    EMT instruction
SIGFPE       8    floating point exception
SIGKILL      9    kill (cannot be caught or ignored)
SIGBUS      10    bus error
SIGSEGV     11    segmentation violation
SIGSYS      12    bad argument to system call
SIGPIPE     13    write on a pipe with no one to read it
SIGALRM     14    alarm clock
SIGTERM     15    software termination signal from kill
SIGURG      16    urgent condition on IO channel
SIGSTOP     17    sendable stop signal not from tty
SIGTSTP     18    stop signal from tty
SIGCONT     19    continue a stopped process
SIGCHLD     20    to parent on child stop or exit
SIGTTIN     21    to readers pgrp upon background tty read
SIGTTOU     22    like TTIN for output if (tp-&gt;t_local&amp;LTOSTOP)
SIGPOLL     23    System V name for SIGIO
SIGXCPU     24    exceeded CPU time limit
SIGXFSZ     25    exceeded file size limit
SIGVTALRM   26    virtual time alarm
SIGPROF     27    profiling time alarm
SIGWINCH    28    window changed
SIGLOST     29    resource lost (eg, record-lock lost)
SIGUSR1     30    user defined signal 1
SIGUSR2     31    user defined signal 2</PRE
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="MKGROUP"
>mkgroup</A
></H2
><PRE
CLASS="SCREEN"
>Usage: mkgroup [OPTION]... [domain]...
Prints /etc/group file to stdout

Options:
   -l,--local             print local group information
   -c,--current           print current group, if a domain account
   -d,--domain            print global group information (from current
                          domain if no domains specified).
   -o,--id-offset offset  change the default offset (10000) added to gids
                          in domain accounts.
   -s,--no-sids           don't print SIDs in pwd field
                          (this affects ntsec)
   -u,--users             print user list in gr_mem field
   -h,--help              print this message

   -v,--version           print version information and exit

One of `-l' or `-d' must be given on NT/W2K.</PRE
><P
>The <B
CLASS="COMMAND"
>mkgroup</B
> program can be used to help
configure your Windows system to be more UNIX-like by creating an
initial <TT
CLASS="FILENAME"
>/etc/group</TT
>.
Its use is essential on the NT series (Windows NT, 2000, and XP) to
include Windows security information.
It can also be used on the Win9x series (Windows 95, 98, and Me) to
create a file with the correct format.
To initially set up your machine if you are a local user, you'd do
something like this:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1185"
></A
><P
><B
>Example 3-6. Setting up the groups file for local accounts</B
></P
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>$</SAMP
> <KBD
CLASS="USERINPUT"
>mkdir /etc</KBD
>
<SAMP
CLASS="PROMPT"
>$</SAMP
> <KBD
CLASS="USERINPUT"
>mkgroup -l &gt; /etc/group</KBD
></PRE
></DIV
><P
>Note that this information is static.  If you change the group
information in your system, you'll need to regenerate the group file
for it to have the new information.</P
><P
>The <VAR
CLASS="LITERAL"
>-d</VAR
> and <VAR
CLASS="LITERAL"
>-l</VAR
> options
allow you to specify where the information comes from, the
local machine or the domain (default or given), or both.
With the  <VAR
CLASS="LITERAL"
>-d</VAR
> option the program contacts the Domain
Controller, which my be unreachable or have restricted access.
An entry for the current domain user can then be created by using the
option <VAR
CLASS="LITERAL"
>-c</VAR
> together with <VAR
CLASS="LITERAL"
>-l</VAR
>,
but <VAR
CLASS="LITERAL"
>-c</VAR
> has no effect when used with <VAR
CLASS="LITERAL"
>-d</VAR
>.
The <VAR
CLASS="LITERAL"
>-o</VAR
> option allows for special cases
(such as multiple domains) where the GIDs might match otherwise.
The <VAR
CLASS="LITERAL"
>-s</VAR
>
option omits the NT Security Identifier (SID).  For more information on 
SIDs, see <A
HREF="ntsec.html"
>the Section called <I
>NT security and the <VAR
CLASS="LITERAL"
>ntsec</VAR
> usage</I
> in Chapter 2</A
> in the Cygwin User's Guide.  The
<VAR
CLASS="LITERAL"
>-u</VAR
> option causes <B
CLASS="COMMAND"
>mkgroup</B
> to 
enumerate the users for each group, placing the group members in the 
gr_mem (last) field.  Note that this can greatly increase
the time for <B
CLASS="COMMAND"
>mkgroup</B
> to run in a large domain.
Having gr_mem fields is helpful when a domain user logs in remotely
while the local machine is disconnected from the Domain Controller.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="MKPASSWD"
>mkpasswd</A
></H2
><PRE
CLASS="SCREEN"
>Usage: mkpasswd [OPTION]... [domain]...
Prints /etc/passwd file to stdout

Options:
   -l,--local              print local user accounts
   -c,--current            print current account, if a domain account
   -d,--domain             print domain accounts (from current domain
                           if no domains specified)
   -o,--id-offset offset   change the default offset (10000) added to uids
                           in domain accounts.
   -g,--local-groups       print local group information too
                           if no domains specified
   -m,--no-mount           don't use mount points for home dir
   -s,--no-sids            don't print SIDs in GCOS field
                           (this affects ntsec)
   -p,--path-to-home path  use specified path and not user account home dir or /home
   -u,--username username  only return information for the specified user
   -h,--help               displays this message
   -v,--version            version information and exit

One of `-l', `-d' or `-g' must be given on NT/W2K.</PRE
><P
>The <B
CLASS="COMMAND"
>mkpasswd</B
> program can be used to help
configure your Windows system to be more UNIX-like by creating an
initial <TT
CLASS="FILENAME"
>/etc/passwd</TT
> from your system information.
Its use is essential on the NT series (Windows NT, 2000, and XP) to
include Windows security information, but the actual passwords are
determined by Windows, not by the content of <TT
CLASS="FILENAME"
>/etc/passwd</TT
>.
On the Win9x series (Windows 95, 98, and Me) the password field must be
replaced by the output of <KBD
CLASS="USERINPUT"
>crypt your_password</KBD
>
if remote access is desired.
To initially set up your machine if you are a local user, you'd do
something like this:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1215"
></A
><P
><B
>Example 3-7. Setting up the passwd file for local accounts</B
></P
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>$</SAMP
> <KBD
CLASS="USERINPUT"
>mkdir /etc</KBD
>
<SAMP
CLASS="PROMPT"
>$</SAMP
> <KBD
CLASS="USERINPUT"
>mkpasswd -l &gt; /etc/passwd</KBD
></PRE
></DIV
><P
>Note that this information is static.  If you change the user
information in your system, you'll need to regenerate the passwd file
for it to have the new information.</P
><P
>The <VAR
CLASS="LITERAL"
>-d</VAR
> and <VAR
CLASS="LITERAL"
>-l</VAR
> options
allow you to specify where the information comes from, the
local machine or the domain (default or given), or both.
With the  <VAR
CLASS="LITERAL"
>-d</VAR
> option the program contacts the Domain
Controller, which my be unreachable or have restricted access.
An entry for the current domain user can then be created by using the
option <VAR
CLASS="LITERAL"
>-c</VAR
> together with <VAR
CLASS="LITERAL"
>-l</VAR
>,
but <VAR
CLASS="LITERAL"
>-c</VAR
> has no effect when used with <VAR
CLASS="LITERAL"
>-d</VAR
>.
The <VAR
CLASS="LITERAL"
>-o</VAR
> option allows for special cases
(such as multiple domains) where the UIDs might match otherwise.
The <VAR
CLASS="LITERAL"
>-g</VAR
> option creates a local
user that corresponds to each local group. This is because NT assigns groups
file ownership.  The <VAR
CLASS="LITERAL"
>-m</VAR
> option bypasses the current
mount table so that, for example, two users who have a Windows home 
directory of H: could mount them differently.  The <VAR
CLASS="LITERAL"
>-s</VAR
>
option omits the NT Security Identifier (SID).  For more information on
SIDs, see <A
HREF="ntsec.html"
>the Section called <I
>NT security and the <VAR
CLASS="LITERAL"
>ntsec</VAR
> usage</I
> in Chapter 2</A
> in the Cygwin User's Guide.  The
<VAR
CLASS="LITERAL"
>-p</VAR
> option causes <B
CLASS="COMMAND"
>mkpasswd</B
> to
use the specified prefix instead of the account home dir or <VAR
CLASS="LITERAL"
>/home/</VAR
>. For example, this command:

<DIV
CLASS="EXAMPLE"
><A
NAME="AEN1239"
></A
><P
><B
>Example 3-8. Using an alternate home root</B
></P
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>$</SAMP
> <KBD
CLASS="USERINPUT"
>mkpasswd -l -p "$(cygpath -H)" &gt; /etc/passwd</KBD
></PRE
></DIV
>

would put local users' home directories in the Windows 'Profiles' directory. 
On Win9x machines the <VAR
CLASS="LITERAL"
>-u</VAR
> option creates an entry for
the specified user. On the NT series it restricts the output to that user,
greatly reducing the amount of time it takes in a large domain.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="MOUNT"
>mount</A
></H2
><PRE
CLASS="SCREEN"
>Usage: mount [OPTION] [&lt;win32path&gt; &lt;posixpath&gt;]
Display information about mounted filesystems, or mount a filesystem

  -b, --binary     (default)    text files are equivalent to binary files
                                (newline = \n)
  -c, --change-cygdrive-prefix  change the cygdrive path prefix to &lt;posixpath&gt;
  -f, --force                   force mount, don't warn about missing mount
                                point directories
  -h, --help                    output usage information and exit
  -m, --mount-commands          write mount commands to replace user and
                                system mount points and cygdrive prefixes
  -o, --options X[,X...]        specify mount options
  -p, --show-cygdrive-prefix    show user and/or system cygdrive path prefix
  -s, --system     (default)    add system-wide mount point
  -t, --text                    text files get \r\n line endings
  -u, --user                    add user-only mount point
  -v, --version                 output version information and exit
  -x, --executable              treat all files under mount point as executables
  -E, --no-executable           treat all files under mount point as 
                                non-executables
  -X, --cygwin-executable       treat all files under mount point as cygwin
                                executables</PRE
><P
>The <B
CLASS="COMMAND"
>mount</B
> program is used to map your drives
and shares onto Cygwin's simulated POSIX directory tree, much like as is
done by mount commands on typical UNIX systems.  Please see
<A
HREF="using.html#MOUNT-TABLE"
>the Section called <I
>The Cygwin Mount Table</I
></A
> for more information on the concepts
behind the Cygwin POSIX file system and strategies for using
mounts. To remove mounts, use <B
CLASS="COMMAND"
>umount</B
></P
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN1252"
>Using mount</A
></H3
><P
>If you just type <B
CLASS="COMMAND"
>mount</B
> with no parameters, it
will display the current mount table for you.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1256"
></A
><P
><B
>Example 3-9. Displaying the current set of mount points</B
></P
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>c:\cygwin\&gt;</SAMP
> <KBD
CLASS="USERINPUT"
>mount</KBD
>
c:\cygwin\bin on /usr/bin type system (binmode)
c:\cygwin\lib on /usr/lib type system (binmode)
c:\cygwin on / type system (binmode)
c: on /c type user (binmode,noumount)
d: on /d type user (binmode,noumount)</PRE
></DIV
><P
>In this example, c:\cygwin is the POSIX root and D drive is mapped to
<TT
CLASS="FILENAME"
>/d</TT
>.  Note that in this case, the root mount is a
system-wide mount point that is visible to all users running Cygwin
programs, whereas the <TT
CLASS="FILENAME"
>/d</TT
> mount is only visible
to the current user.</P
><P
>The <B
CLASS="COMMAND"
>mount</B
> utility is also the mechanism for
adding new mounts to the mount table.  The following example
demonstrates how to mount the directory
<TT
CLASS="FILENAME"
>\\pollux\home\joe\data</TT
> to <TT
CLASS="FILENAME"
>/data</TT
>.</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1268"
></A
><P
><B
>Example 3-10. Adding mount points</B
></P
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>c:\cygwin\&gt;</SAMP
> <KBD
CLASS="USERINPUT"
>ls /data</KBD
>
ls: /data: No such file or directory
<SAMP
CLASS="PROMPT"
>c:\cygwin\&gt;</SAMP
> <KBD
CLASS="USERINPUT"
>mount \\pollux\home\joe\data /data</KBD
>
mount: warning - /data does not exist!
<SAMP
CLASS="PROMPT"
>c:\cygwin\&gt;</SAMP
> <KBD
CLASS="USERINPUT"
>mount</KBD
>
\\pollux\home\joe\data on /data type sytem (binmode)
c:\cygwin\bin on /usr/bin type system (binmode)
c:\cygwin\lib on /usr/lib type system (binmode)
c:\cygwin on / type system (binmode)
c: on /c type user (binmode,noumount)
d: on /d type user (binmode,noumount)</PRE
></DIV
><P
>Note that <B
CLASS="COMMAND"
>mount</B
> was invoked from the Windows
command shell in the previous example.  In many Unix shells, including
bash, it is legal and convenient to use the forward "/" in Win32
pathnames since the "\" is the shell's escape character. </P
><P
>The <VAR
CLASS="LITERAL"
>-s</VAR
> flag to <B
CLASS="COMMAND"
>mount</B
> is used to add a mount
in the system-wide mount table used by all Cygwin users on the system,
instead of the user-specific one.  System-wide mounts are displayed
by <B
CLASS="COMMAND"
>mount</B
> as being of the "system" type, as is the
case for the <TT
CLASS="FILENAME"
>/</TT
> partition in the last example.
Under Windows NT, only those users with Administrator priviledges are
permitted to modify the system-wide mount table.</P
><P
>Note that a given POSIX path may only exist once in the user
table and once in the global, system-wide table.  Attempts to replace
the mount will fail with a busy error.  The <VAR
CLASS="LITERAL"
>-f</VAR
> (force) flag causes
the old mount to be silently replaced with the new one.  It will also
silence warnings about the non-existence of directories at the Win32
path location.</P
><P
>The <VAR
CLASS="LITERAL"
>-b</VAR
> flag is used to instruct Cygwin to treat binary and
text files in the same manner by default.  Binary mode mounts are
marked as "binmode" in the Flags column of <B
CLASS="COMMAND"
>mount</B
>
output.  By default, mounts are in text mode ("textmode" in the Flags
column).</P
><P
>Normally, files ending in certain extensions (.exe, .com, .bat, .cmd) 
are assumed to be executable.  Files whose first two characters begin with 
'#!' are also considered to be executable.  
The <VAR
CLASS="LITERAL"
>-x</VAR
> flag is used to instruct Cygwin that the 
mounted file is "executable".  If the <VAR
CLASS="LITERAL"
>-x</VAR
> flag is used 
with a directory then all files in the directory are executable.  
This option allows other files to be marked as executable and avoids the 
overhead of opening each file to check for a '#!'.  The <VAR
CLASS="LITERAL"
>-X</VAR
>
option is very similar to <VAR
CLASS="LITERAL"
>-x</VAR
>, but also prevents Cygwin
from setting up commands and environment variables for a normal Windows 
program, adding another small performance gain.  The opposite of these 
flags is the <VAR
CLASS="LITERAL"
>-E</VAR
> flag, which means that no files should be 
marked as executable.  </P
><P
>The <VAR
CLASS="LITERAL"
>-m</VAR
> option causes the <B
CLASS="COMMAND"
>mount</B
> utility
to output a series of commands that could recreate both user and system mount 
points. You can save this output as a backup when experimenting with the
mount table. It also makes moving your settings to a different machine
much easier.</P
><P
>The <VAR
CLASS="LITERAL"
>-o</VAR
> option is the method via which various options about
the mount point may be recorded.  The following options are available (note that
most of the options are duplicates of other mount flags):</P
><PRE
CLASS="SCREEN"
>  user       - mount lives user-specific mount
  system     - mount lives in system table (default)
  binary     - files default to binary mode (default)
  text       - files default to CRLF text mode line endings
  exec       - files below mount point are all executable
  notexec    - files below mount point are not executable
  cygexec    - files below mount point are all cygwin executables
  nosuid     - no suid files are allowed (currently unimplemented)
  managed    - directory is managed by cygwin.  Mixed case and special
               characters in filenames are allowed.</PRE
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN1301"
>Cygdrive mount points</A
></H3
><P
>Whenever Cygwin cannot use any of the existing mounts to convert
from a particular Win32 path to a POSIX one, Cygwin will, instead,
convert to a POSIX path using a default mount point:
<TT
CLASS="FILENAME"
>/cygdrive</TT
>.  For example, if Cygwin accesses
<TT
CLASS="FILENAME"
>z:\foo</TT
> and the z drive is not currently in the
mount table, then <TT
CLASS="FILENAME"
>z:\</TT
> will be accessible as
<TT
CLASS="FILENAME"
>/cygdrive/z</TT
>.  The <B
CLASS="COMMAND"
>mount</B
> utility 
can be used to change this default automount prefix through the use of the
"--change-cygdrive-prefix" option.  In the following example, we will
set the automount prefix to <TT
CLASS="FILENAME"
>/</TT
>:</P
><DIV
CLASS="EXAMPLE"
><A
NAME="AEN1310"
></A
><P
><B
>Example 3-11. Changing the default prefix</B
></P
><PRE
CLASS="SCREEN"
><SAMP
CLASS="PROMPT"
>c:\cygwin\&gt;</SAMP
> <KBD
CLASS="USERINPUT"
>mount --change-cygdrive-prefix /</KBD
></PRE
></DIV
><P
>Note that if you set a new prefix in this manner, you can
specify the <VAR
CLASS="LITERAL"
>-s</VAR
> flag to make this the system-wide default 
prefix.  By default, the cygdrive-prefix applies only to the system-wide setting.  
You can always see the user and system cygdrive prefixes with the 
<VAR
CLASS="LITERAL"
>-p</VAR
> option.  Using the <VAR
CLASS="LITERAL"
>-b</VAR
>
flag with <VAR
CLASS="LITERAL"
>--change-cygdrive-prefix</VAR
> makes all new 
automounted filesystems default to binary mode file accesses.</P
></DIV
><DIV
CLASS="SECT3"
><H3
CLASS="SECT3"
><A
NAME="AEN1320"
>Limitations</A
></H3
><P
>Limitations: there is a hard-coded limit of 30 mount
points.  Also, although you can mount to pathnames that do not start
with "/", there is no way to make use of such mount points.</P
><P
>Normally the POSIX mount point in Cygwin is an existing empty
directory, as in standard UNIX. If this is the case, or if there is a
place-holder for the mount point (such as a file, a symbolic link
pointing anywhere, or a non-empty directory), you will get the expected
behavior. Files present in a mount point directory before the mount
become invisible to Cygwin programs.</P
><P
>It is sometimes desirable to mount to a non-existent directory,
for example to avoid cluttering the root directory with names
such as
<TT
CLASS="FILENAME"
>a</TT
>, <TT
CLASS="FILENAME"
>b</TT
>, <TT
CLASS="FILENAME"
>c</TT
>
pointing to disks.
Although <B
CLASS="COMMAND"
>mount</B
> will give you a warning, most
everything will work properly when you refer to the mount point
explicitly.  Some strange effects can occur however.
For example if your current working directory is
<TT
CLASS="FILENAME"
>/dir</TT
>,
say, and <TT
CLASS="FILENAME"
>/dir/mtpt</TT
> is a mount point, then
<TT
CLASS="FILENAME"
>mtpt</TT
> will not show up in an <B
CLASS="COMMAND"
>ls</B
>
or
<B
CLASS="COMMAND"
>echo *</B
> command and <B
CLASS="COMMAND"
>find .</B
> will
not
find <TT
CLASS="FILENAME"
>mtpt</TT
>.</P
></DIV
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="PASSWD"
>passwd</A
></H2
><PRE
CLASS="SCREEN"
>Usage: passwd [OPTION] [USER]
Change USER's password or password attributes.

User operations:
  -l, --lock               lock USER's account.
  -u, --unlock             unlock USER's account.
  -c, --cannot-change      USER can't change password.
  -C, --can-change         USER can change password.
  -e, --never-expires      USER's password never expires.
  -E, --expires            USER's password expires according to system's
                           password aging rule.
  -p, --pwd-not-required   no password required for USER.
  -P, --pwd-required       password is required for USER.

System operations:
  -i, --inactive NUM       set NUM of days before inactive accounts are disabled
                           (inactive accounts are those with expired passwords).
  -n, --minage DAYS        set system minimum password age to DAYS days.
  -x, --maxage DAYS        set system maximum password age to DAYS days.
  -L, --length LEN         set system minimum password length to LEN.

Other options:
  -S, --status             display password status for USER (locked, expired,
                           etc.) plus global system password settings.
  -h, --help               output usage information and exit.
  -v, --version            output version information and exit.

If no option is given, change USER's password.  If no user name is given,
operate on current user.  System operations must not be mixed with user
operations.  Don't specify a USER when triggering a system operation. </PRE
><P
> <B
CLASS="COMMAND"
>passwd</B
> changes passwords for user accounts.
A normal user may only change the password for their own account,
but administrators may change passwords on any account.
<B
CLASS="COMMAND"
>passwd</B
> also changes account information, such as
password expiry dates and intervals.</P
><P
>For password changes, the user is first prompted for their old
password, if one is present.  This password is then encrypted and
compared against the stored password.  The user has only one chance to
enter the correct password.  The administrators are permitted to
bypass this step so that forgotten passwords may be changed.</P
><P
>The user is then prompted for a replacement password.
<B
CLASS="COMMAND"
>passwd</B
> will prompt twice for this replacement and 
compare the second entry against the first.  Both entries are required to 
match in order for the password to be changed.</P
><P
>After the password has been entered, password aging information
is checked to see if the user is permitted to change their password
at this time.  If not, <B
CLASS="COMMAND"
>passwd</B
> refuses to change the
password and exits.</P
><P
>To get current password status information, use the
<VAR
CLASS="LITERAL"
>-S</VAR
> option. Administrators can use
<B
CLASS="COMMAND"
>passwd</B
> to perform several account maintenance
functions (users may perform some of these functions on their own
accounts).  Accounts may be locked with the <VAR
CLASS="LITERAL"
>-l</VAR
> flag
and unlocked with the <VAR
CLASS="LITERAL"
>-u</VAR
> flag.  Similarly,
<VAR
CLASS="LITERAL"
>-c</VAR
> disables a user's ability to change passwords, and
<VAR
CLASS="LITERAL"
>-C</VAR
> allows a user to change passwords.  For password
expiry, the <VAR
CLASS="LITERAL"
>-e</VAR
> option disables expiration, while the
<VAR
CLASS="LITERAL"
>-E</VAR
> option causes the password to expire according to
the system's normal aging rules.  Use <VAR
CLASS="LITERAL"
>-p</VAR
> to disable
the password requirement for a user, or <VAR
CLASS="LITERAL"
>-P</VAR
> to require
a password.</P
><P
>Administrators can also use <B
CLASS="COMMAND"
>passwd</B
> to change
system-wide password expiry and length requirements with the
<VAR
CLASS="LITERAL"
>-i</VAR
>, <VAR
CLASS="LITERAL"
>-n</VAR
>, <VAR
CLASS="LITERAL"
>-x</VAR
>,
and <VAR
CLASS="LITERAL"
>-L</VAR
> options.  The <VAR
CLASS="LITERAL"
>-i</VAR
>
option is used to disable an account after the password has been expired
for a number of days.  After a user account has had an expired password
for <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>NUM</I
></SPAN
> days, the user may no longer sign on to
the account.  The <VAR
CLASS="LITERAL"
>-n</VAR
> option is
used to set the minimum number of days before a password may be changed.
The user will not be permitted to change the password until
<SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>MINDAYS</I
></SPAN
> days have elapsed.  The
<VAR
CLASS="LITERAL"
>-x</VAR
> option is used to set the maximum number of days
a password remains valid.  After <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>MAXDAYS</I
></SPAN
> days, the
password is required to be changed.  Allowed values for the above options 
are 0 to 999.  The <VAR
CLASS="LITERAL"
>-L</VAR
> option sets the minimum length of 
allowed passwords for users who don't belong to the administrators group
to <SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>LEN</I
></SPAN
> characters.  Allowed values for the minimum
password length are 0 to 14.  In any of the above cases, a value of 0
means `no restrictions'.</P
><P
>Limitations: Users may not be able to change their password on
some systems.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="PS"
>ps</A
></H2
><PRE
CLASS="SCREEN"
>Usage: ps [-aefls] [-u UID]
Report process status

 -a, --all       show processes of all users
 -e, --everyone  show processes of all users
 -f, --full      show process uids, ppids
 -h, --help      output usage information and exit
 -l, --long      show process uids, ppids, pgids, winpids
 -s, --summary   show process summary
 -u, --user      list processes owned by UID
 -v, --version   output version information and exit
 -W, --windows   show windows as well as cygwin processes
With no options, ps outputs the long format by default</PRE
><P
>The <B
CLASS="COMMAND"
>ps</B
> program gives the status of all the
Cygwin processes running on the system (ps = "process status").  Due
to the limitations of simulating a POSIX environment under Windows,
there is little information to give.  </P
><P
>The PID column is the process ID you need to give to the 
<B
CLASS="COMMAND"
>kill</B
> command. The PPID is the parent process ID,
and PGID is the process group ID.  The WINPID column is the process 
ID displayed by NT's Task Manager program. The TTY column gives which 
pseudo-terminal a process is running on, or a <VAR
CLASS="LITERAL"
>'?'</VAR
>
for services. The UID column shows which user owns each process. 
STIME is the time the process was started, and COMMAND gives the name
of the program running.</P
><P
>By default <B
CLASS="COMMAND"
>ps</B
> will only show processes owned by the
current user. With either the <VAR
CLASS="LITERAL"
>-a</VAR
> or <VAR
CLASS="LITERAL"
>-e</VAR
>
option, all user's processes (and system processes) are listed. There are
historical UNIX reasons for the synonomous options, which are functionally
identical. The <VAR
CLASS="LITERAL"
>-f</VAR
> option outputs a "full" listing with
usernames for UIDs. The <VAR
CLASS="LITERAL"
>-l</VAR
> option is the default display
mode, showing a "long" listing with all the above columns. The other display
option is <VAR
CLASS="LITERAL"
>-s</VAR
>, which outputs a shorter listing of just
PID, TTY, STIME, and COMMAND. The <VAR
CLASS="LITERAL"
>-u</VAR
> option allows you
to show only processes owned by a specific user. The <VAR
CLASS="LITERAL"
>-W</VAR
>
option causes <B
CLASS="COMMAND"
>ps</B
> show non-Cygwin Windows processes as 
well as Cygwin processes. The WINPID is also the PID, and they can be killed
with the Cygwin <B
CLASS="COMMAND"
>kill</B
> command's <VAR
CLASS="LITERAL"
>-f</VAR
>
option.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="REGTOOL"
>regtool</A
></H2
><PRE
CLASS="SCREEN"
>Usage: regtool.exe [OPTION] (add | check | get | list | remove | unset) KEY
View or edit the Win32 registry

Actions:
 add KEY\SUBKEY             add new SUBKEY
 check KEY                  exit 0 if KEY exists, 1 if not
 get KEY\VALUE              prints VALUE to stdout
 list KEY                   list SUBKEYs and VALUEs
 remove KEY                 remove KEY
 set KEY\VALUE [data ...]   set VALUE
 unset KEY\VALUE            removes VALUE from KEY

Options for 'list' Action:
 -k, --keys           print only KEYs
 -l, --list           print only VALUEs
 -p, --postfix        like ls -p, appends '\' postfix to KEY names

Options for 'set' Action:
 -e, --expand-string  set type to REG_EXPAND_SZ
 -i, --integer        set type to REG_DWORD
 -m, --multi-string   set type to REG_MULTI_SZ
 -s, --string         set type to REG_SZ

Options for 'set' and 'unset' Actions:
 -K&lt;c&gt;, --key-separator[=]&lt;c&gt;  set key separator to &lt;c&gt; instead of '\'

Other Options:
 -h, --help     output usage information and exit
 -q, --quiet    no error output, just nonzero return if KEY/VALUE missing
 -v, --verbose  verbose output, including VALUE contents when applicable
 -V, --version  output version information and exit

KEY is in the format [host]\prefix\KEY\KEY\VALUE, where host is optional
remote host in either \\hostname or hostname: format and prefix is any of:
  root     HKCR  HKEY_CLASSES_ROOT (local only)
  config   HKCC  HKEY_CURRENT_CONFIG (local only)
  user     HKCU  HKEY_CURRENT_USER (local only)
  machine  HKLM  HKEY_LOCAL_MACHINE
  users    HKU   HKEY_USERS

You can use forward slash ('/') as a separator instead of backslash, in
that case backslash is treated as escape character
Example: regtool.exe get '\user\software\Microsoft\Clock\iFormat'</PRE
><P
>The <B
CLASS="COMMAND"
>regtool</B
> program allows shell scripts
to access and modify the Windows registry.  Note that modifying the
Windows registry is dangerous, and carelessness here can result
in an unusable system.  Be careful.</P
><P
>The <VAR
CLASS="LITERAL"
>-v</VAR
> option means "verbose".  For most
commands, this causes additional or lengthier messages to be printed.
Conversely, the <VAR
CLASS="LITERAL"
>-q</VAR
> option supresses error messages,
so you can use the exit status of the program to detect if a key
exists or not (for example).</P
><P
>You must provide <B
CLASS="COMMAND"
>regtool</B
> with an 
<SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>action</I
></SPAN
> following options (if any). Currently,
the action must be <VAR
CLASS="LITERAL"
>add</VAR
>, <VAR
CLASS="LITERAL"
>set</VAR
>,
<VAR
CLASS="LITERAL"
>check</VAR
>, <VAR
CLASS="LITERAL"
>get</VAR
>, <VAR
CLASS="LITERAL"
>list</VAR
>,
<VAR
CLASS="LITERAL"
>remove</VAR
>, <VAR
CLASS="LITERAL"
>set</VAR
>, or <VAR
CLASS="LITERAL"
>unset</VAR
>.</P
><P
>The <VAR
CLASS="LITERAL"
>add</VAR
> action adds a new key.  The 
<VAR
CLASS="LITERAL"
>check</VAR
> action checks to see if a key exists (the 
exit code of the program is zero if it does, nonzero if it does not).
The <VAR
CLASS="LITERAL"
>get</VAR
> action gets the value of a value of a key,
and prints it (and nothing else) to stdout.  Note: if the value
doesn't exist, an error message is printed and the program returns a
non-zero exit code.  If you give <VAR
CLASS="LITERAL"
>-q</VAR
>, it doesn't
print the message but does return the non-zero exit code.</P
><P
>The <VAR
CLASS="LITERAL"
>list</VAR
> action lists the subkeys and values
belonging to the given key. With <VAR
CLASS="LITERAL"
>list</VAR
>, the 
<VAR
CLASS="LITERAL"
>-k</VAR
> option instructs <B
CLASS="COMMAND"
>regtool</B
>
to print only KEYs, and the <VAR
CLASS="LITERAL"
>-l</VAR
> option to print
only VALUEs. The <VAR
CLASS="LITERAL"
>-p</VAR
> option postfixes a 
<VAR
CLASS="LITERAL"
>'/'</VAR
> to each KEY, but leave VALUEs with no
postfix.  The <VAR
CLASS="LITERAL"
>remove</VAR
> action 
removes a key.  Note that you may need to remove everything in the key 
before you may remove it, but don't rely on this stopping you from 
accidentally removing too much.  </P
><P
>The <VAR
CLASS="LITERAL"
>set</VAR
> action sets a value within a key.
<VAR
CLASS="LITERAL"
>-e</VAR
> means it's an expanding string (REG_EXPAND_SZ)
that contains embedded environment variables.  
<VAR
CLASS="LITERAL"
>-i</VAR
> means the value is an integer (REG_DWORD).
<VAR
CLASS="LITERAL"
>-m</VAR
> means it's a multi-string (REG_MULTI_SZ).  
<VAR
CLASS="LITERAL"
>-s</VAR
> means the value is a string (REG_SZ).
If you don't specify one of these, <B
CLASS="COMMAND"
>regtool</B
> tries to
guess the type based on the value you give.  If it looks like a
number, it's a DWORD.  If it starts with a percent, it's an expanding
string.  If you give multiple values, it's a multi-string.  Else, it's
a regular string.
The <VAR
CLASS="LITERAL"
>unset</VAR
> action removes a value from a key.</P
><P
>By default, the last "\" or "/" is assumed to be the separator between the
key and the value.  You can use the <VAR
CLASS="LITERAL"
>-K</VAR
> option to provide 
an alternate key/value separator character.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="SETFACL"
>setfacl</A
></H2
><PRE
CLASS="SCREEN"
>Usage: setfacl [-r] (-f ACL_FILE | -s acl_entries) FILE...
       setfacl [-r] ([-d acl_entries] [-m acl_entries]) FILE...
Modify file and directory access control lists (ACLs)

  -d, --delete     delete one or more specified ACL entries
  -f, --file       set ACL entries for FILE to ACL entries read
                   from a ACL_FILE
  -m, --modify     modify one or more specified ACL entries
  -r, --replace    replace mask entry with maximum permissions
                   needed for the file group class
  -s, --substitute substitute specified ACL entries for the
                   ACL of FILE
  -h, --help       output usage information and exit
  -v, --version    output version information and exit

At least one of (-d, -f, -m, -s) must be specified</PRE
><P
>For each file given as parameter, <B
CLASS="COMMAND"
>setfacl</B
> will 
either replace its complete ACL (<VAR
CLASS="LITERAL"
>-s</VAR
>, <VAR
CLASS="LITERAL"
>-f</VAR
>), 
or it will add, modify, or delete ACL entries.
For more information on Cygwin and Windows ACLs, see
see <A
HREF="ntsec.html"
>the Section called <I
>NT security and the <VAR
CLASS="LITERAL"
>ntsec</VAR
> usage</I
> in Chapter 2</A
> in the Cygwin User's Guide.</P
><P
>Acl_entries are one or more comma-separated ACL entries 
from the following list:
<PRE
CLASS="SCREEN"
>         u[ser]::perm
         u[ser]:uid:perm
         g[roup]::perm
         g[roup]:gid:perm
         m[ask]::perm
         o[ther]::perm</PRE
>
Default entries are like the above with the additional
default identifier. For example: 
<PRE
CLASS="SCREEN"
>         d[efault]:u[ser]:uid:perm</PRE
></P
><P
><SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>perm</I
></SPAN
> is either a 3-char permissions string in the form
"rwx" with the character <VAR
CLASS="LITERAL"
>'-'</VAR
> for no permission
or it is the octal representation of the permissions, a
value from 0 (equivalent to "---") to 7 ("rwx").
<SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>uid</I
></SPAN
> is a user name or a numerical uid.
<SPAN
CLASS="emphasis"
><I
CLASS="EMPHASIS"
>gid</I
></SPAN
> is a group name or a numerical gid.</P
><P
>The following options are supported:</P
><P
><VAR
CLASS="LITERAL"
>-d</VAR
>
Delete one or more specified entries from the file's ACL.
The owner, group and others entries must not be deleted.
Acl_entries to be deleted should be specified without
permissions, as in the following list:
<PRE
CLASS="SCREEN"
>         u[ser]:uid
         g[roup]:gid
         d[efault]:u[ser]:uid
         d[efault]:g[roup]:gid
         d[efault]:m[ask]:
         d[efault]:o[ther]:</PRE
></P
><P
><VAR
CLASS="LITERAL"
>-f</VAR
>
Take the Acl_entries from ACL_FILE one per line. Whitespace
characters are ignored, and the character "#" may be used
to start a comment.  The special filename "-" indicates
reading from stdin. Note that you can use this with 
<B
CLASS="COMMAND"
>getfacl</B
> and <B
CLASS="COMMAND"
>setfacl</B
> to copy 
ACLs from one file to another:
<PRE
CLASS="SCREEN"
>$ getfacl source_file | setfacl -f - target_file</PRE
></P
><P
>Required entries are: 
one user entry for the owner of the file,
one group entry for the group of the file, and
one other entry.</P
><P
>If additional user and group entries are given:
a mask entry for the file group class of the file, and 
no duplicate user or group entries with the same uid/gid.</P
><P
>If it is a directory:
one default user entry for the owner of the file,
one default group entry for the group of the file,
one default mask entry for the file group class, and
one default other entry.</P
><P
><VAR
CLASS="LITERAL"
>-m</VAR
>
Add or modify one or more specified ACL entries.  Acl_entries is a 
comma-separated list of entries from the same list as above.</P
><P
><VAR
CLASS="LITERAL"
>-r</VAR
>   
Causes the permissions specified in the mask 
entry to be ignored and replaced by the maximum permissions needed for 
the file group class.</P
><P
><VAR
CLASS="LITERAL"
>-s</VAR
>   
Like <VAR
CLASS="LITERAL"
>-f</VAR
>, but substitute the 
file's ACL with Acl_entries specified in a comma-separated list on the 
command line.</P
><P
>While the <VAR
CLASS="LITERAL"
>-d</VAR
> and <VAR
CLASS="LITERAL"
>-m</VAR
> options may be used 
in the same command, the <VAR
CLASS="LITERAL"
>-f</VAR
> and <VAR
CLASS="LITERAL"
>-s</VAR
> 
options may be used only exclusively.</P
><P
>Directories may contain default ACL entries.  Files created
in a directory that contains default ACL entries will have
permissions according to the combination of the current umask,
the explicit permissions requested and the default ACL entries</P
><P
>Limitations: Under Cygwin, the default ACL entries are not taken into
account currently.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="SSP"
>ssp</A
></H2
><PRE
CLASS="SCREEN"
>Usage: ssp [options] low_pc high_pc command...
Single-step profile COMMAND

 -c, --console-trace  trace every EIP value to the console. *Lots* slower.
 -d, --disable        disable single-stepping by default; use
                      OutputDebugString ("ssp on") to enable stepping
 -e, --enable         enable single-stepping by default; use
                      OutputDebugString ("ssp off") to disable stepping
 -h, --help           output usage information and exit
 -l, --dll            enable dll profiling.  A chart of relative DLL usage
                      is produced after the run.
 -s, --sub-threads    trace sub-threads too.  Dangerous if you have
                      race conditions.
 -t, --trace-eip      trace every EIP value to a file TRACE.SSP.  This
                      gets big *fast*.
 -v, --verbose        output verbose messages about debug events.
 -V, --version        output version information and exit

Example: ssp 0x401000 0x403000 hello.exe</PRE
><P
>SSP - The Single Step Profiler</P
><P
>Original Author:  DJ Delorie </P
><P
>The SSP is a program that uses the Win32 debug API to run a program
one ASM instruction at a time.  It records the location of each
instruction used, how many times that instruction is used, and all
function calls.  The results are saved in a format that is usable by
the profiling program <B
CLASS="COMMAND"
>gprof</B
>, although 
<B
CLASS="COMMAND"
>gprof</B
> will claim the values
are seconds, they really are instruction counts.  More on that later.</P
><P
>Because the SSP was originally designed to profile the cygwin DLL, it
does not automatically select a block of code to report statistics on.
You must specify the range of memory addresses to keep track of
manually, but it's not hard to figure out what to specify.  Use the
"objdump" program to determine the bounds of the target's ".text"
section.  Let's say we're profiling cygwin1.dll.  Make sure you've
built it with debug symbols (else <B
CLASS="COMMAND"
>gprof</B
> won't run) 
and run objdump like this:

<PRE
CLASS="SCREEN"
>$ objdump -h cygwin1.dll</PRE
>

It will print a report like this:
<PRE
CLASS="SCREEN"
>cygwin1.dll:     file format pei-i386

Sections:
Idx Name          Size      VMA       LMA       File off  Algn
  0 .text         0007ea00  61001000  61001000  00000400  2**2
                  CONTENTS, ALLOC, LOAD, READONLY, CODE, DATA
  1 .data         00008000  61080000  61080000  0007ee00  2**2
                  CONTENTS, ALLOC, LOAD, DATA
  . . .</PRE
></P
><P
>The only information we're concerned with are the VMA of 
the .text section and the VMA of the section after it 
(sections are usually contiguous; you can also add the 
Size to the VMA to get the end address).  In this case, 
the VMA is 0x61001000 and the ending address is either 
0x61080000 (start of .data method) or 0x0x6107fa00 (VMA+Size
method).</P
><P
>There are two basic ways to use SSP - either profiling a whole
program, or selectively profiling parts of the program.</P
><P
>To profile a whole program, just run <B
CLASS="COMMAND"
>ssp</B
> without options.  
By default, it will step the whole program.  Here's a simple example, using 
the numbers above:

<PRE
CLASS="SCREEN"
>$ ssp 0x61001000 0x61080000 hello.exe</PRE
>

This will step the whole program.  It will take at least 8 minutes on
a PII/300 (yes, really).  When it's done, it will create a file called
"gmon.out".  You can turn this data file into a readable report with
<B
CLASS="COMMAND"
>gprof</B
>:

<PRE
CLASS="SCREEN"
>$ gprof -b cygwin1.dll</PRE
>

The "-b" means 'skip the help pages'.  You can omit this until you're
familiar with the report layout.  The <B
CLASS="COMMAND"
>gprof</B
> documentation 
explains a lot about this report, but <B
CLASS="COMMAND"
>ssp</B
> changes a few 
things.  For example, the first part of the report reports the amount of time 
spent in each function, like this:

<PRE
CLASS="SCREEN"
>Each sample counts as 0.01 seconds.
  %   cumulative   self              self     total
 time   seconds   seconds    calls  ms/call  ms/call  name
 10.02    231.22    72.43       46  1574.57  1574.57  strcspn
  7.95    288.70    57.48      130   442.15   442.15  strncasematch</PRE
>

The "seconds" columns are really CPU opcodes, 1/100 second per opcode.
So, "231.22" above means 23,122 opcodes.  The ms/call values are 10x
too big; 1574.57 means 157.457 opcodes per call.  Similar adjustments
need to be made for the "self" and "children" columns in the second
part of the report.</P
><P
>OK, so now we've got a huge report that took a long time to generate,
and we've identified a spot we want to work on optimizing.  Let's say
it's the time() function.  We can use SSP to selectively profile this
function by using OutputDebugString() to control SSP from within the
program.  Here's a sample program:

<PRE
CLASS="SCREEN"
>	#include &lt;windows.h&gt;
	main()
	{
	  time_t t;
	  OutputDebugString("ssp on");
	  time(&amp;t);
	  OutputDebugString("ssp off");
	}</PRE
></P
><P
>Then, add the <VAR
CLASS="LITERAL"
>-d</VAR
> option to ssp to default to 
*disabling* profiling.  The program will run at full speed until the first 
OutputDebugString, then step until the second.
You can then use <B
CLASS="COMMAND"
>gprof</B
> (as usual) to see the performance 
profile for just that portion of the program's execution.</P
><P
>There are many options to ssp.  Since step-profiling makes your
program run about 1,000 times slower than normal, it's best to
understand all the options so that you can narrow down the parts
of your program you need to single-step.</P
><P
><VAR
CLASS="LITERAL"
>-v</VAR
> - verbose.  This prints messages about threads 
starting and stopping, OutputDebugString calls, DLLs loading, etc.</P
><P
><VAR
CLASS="LITERAL"
>-t</VAR
> and <VAR
CLASS="LITERAL"
>-c</VAR
> - tracing.  
With <VAR
CLASS="LITERAL"
>-t</VAR
>, *every* step's address is written
to the file "trace.ssp".  This can be used to help debug functions,
since it can trace multiple threads.  Clever use of scripts can match
addresses with disassembled opcodes if needed.  Warning: creates
*huge* files, very quickly.  <VAR
CLASS="LITERAL"
>-c</VAR
> prints each address to 
the console, useful for debugging key chunks of assembler.  Use 
<VAR
CLASS="LITERAL"
>addr2line -C -f -s -e foo.exe &lt; trace.ssp &gt; lines.ssp</VAR
>
and then <VAR
CLASS="LITERAL"
>perl cvttrace</VAR
> to convert to symbolic traces.</P
><P
><VAR
CLASS="LITERAL"
>-s</VAR
> - subthreads.  Usually, you only need to trace the 
main thread, but sometimes you need to trace all threads, so this enables that.
It's also needed when you want to profile a function that only a
subthread calls.  However, using OutputDebugString automatically
enables profiling on the thread that called it, not the main thread.</P
><P
><VAR
CLASS="LITERAL"
>-l</VAR
> - dll profiling.  Generates a pretty table of how much 
time was spent in each dll the program used.  No sense optimizing a function in
your program if most of the time is spent in the DLL.
I usually use the <VAR
CLASS="LITERAL"
>-v</VAR
>, <VAR
CLASS="LITERAL"
>-s</VAR
>, and 
<VAR
CLASS="LITERAL"
>-l</VAR
> options:

<PRE
CLASS="SCREEN"
>$ ssp <VAR
CLASS="LITERAL"
>-v</VAR
> <VAR
CLASS="LITERAL"
>-s</VAR
> <VAR
CLASS="LITERAL"
>-l</VAR
> <VAR
CLASS="LITERAL"
>-d</VAR
> 0x61001000 0x61080000 hello.exe</PRE
></P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="STRACE"
>strace</A
></H2
><PRE
CLASS="SCREEN"
>Usage: strace.exe [OPTIONS] &lt;command-line&gt;
Usage: strace.exe [OPTIONS] -p &lt;pid&gt;
Trace system calls and signals

  -b, --buffer-size=SIZE       set size of output file buffer
  -d, --no-delta               don't display the delta-t microsecond timestamp
  -f, --trace-children         trace child processes (toggle - default true)
  -h, --help                   output usage information and exit
  -m, --mask=MASK              set message filter mask
  -n, --crack-error-numbers    output descriptive text instead of error
                               numbers for Windows errors
  -o, --output=FILENAME        set output file to FILENAME
  -p, --pid=n                  attach to executing program with cygwin pid n
  -S, --flush-period=PERIOD    flush buffered strace output every PERIOD secs
  -t, --timestamp              use an absolute hh:mm:ss timestamp insted of 
                               the default microsecond timestamp.  Implies -d
  -T, --toggle                 toggle tracing in a process already being
                               traced. Requires -p &lt;pid&gt;
  -v, --version                output version information and exit
  -w, --new-window             spawn program under test in a new window

    MASK can be any combination of the following mnemonics and/or hex values
    (0x is optional).  Combine masks with '+' or ',' like so:

                      --mask=wm+system,malloc+0x00800

    Mnemonic Hex     Corresponding Def  Description
    =========================================================================
    all      0x00001 (_STRACE_ALL)      All strace messages.
    flush    0x00002 (_STRACE_FLUSH)    Flush output buffer after each message.
    inherit  0x00004 (_STRACE_INHERIT)  Children inherit mask from parent.
    uhoh     0x00008 (_STRACE_UHOH)     Unusual or weird phenomenon.
    syscall  0x00010 (_STRACE_SYSCALL)  System calls.
    startup  0x00020 (_STRACE_STARTUP)  argc/envp printout at startup.
    debug    0x00040 (_STRACE_DEBUG)    Info to help debugging. 
    paranoid 0x00080 (_STRACE_PARANOID) Paranoid info.
    termios  0x00100 (_STRACE_TERMIOS)  Info for debugging termios stuff.
    select   0x00200 (_STRACE_SELECT)   Info on ugly select internals.
    wm       0x00400 (_STRACE_WM)       Trace Windows msgs (enable _strace_wm).
    sigp     0x00800 (_STRACE_SIGP)     Trace signal and process handling.
    minimal  0x01000 (_STRACE_MINIMAL)  Very minimal strace output.
    exitdump 0x04000 (_STRACE_EXITDUMP) Dump strace cache on exit.
    system   0x08000 (_STRACE_SYSTEM)   Serious error; goes to console and log.
    nomutex  0x10000 (_STRACE_NOMUTEX)  Don't use mutex for synchronization.
    malloc   0x20000 (_STRACE_MALLOC)   Trace malloc calls.
    thread   0x40000 (_STRACE_THREAD)   Thread-locking calls.</PRE
><P
>The <B
CLASS="COMMAND"
>strace</B
> program executes a program, and
optionally the children of the program, reporting any Cygwin DLL output
from the program(s) to stdout, or to a file with the <VAR
CLASS="LITERAL"
>-o</VAR
>
option.  With the <VAR
CLASS="LITERAL"
>-w</VAR
> option, you can start an strace
session in a new window, for example:

<PRE
CLASS="SCREEN"
>$ strace -o tracing_output -w sh -c 'while true; do echo "tracing..."; done' &amp;</PRE
>
This is particularly useful for <B
CLASS="COMMAND"
>strace</B
> sessions that
take a long time to complete.</P
><P
>Note that <B
CLASS="COMMAND"
>strace</B
> is a standalone Windows program and so does 
not rely on the Cygwin DLL itself (you can verify this with 
<B
CLASS="COMMAND"
>cygcheck</B
>). As a result it does not understand POSIX
pathnames or symlinks.  This program is mainly useful for debugging the 
Cygwin DLL itself.</P
></DIV
><DIV
CLASS="SECT2"
><H2
CLASS="SECT2"
><A
NAME="UMOUNT"
>umount</A
></H2
><PRE
CLASS="SCREEN"
>Usage: umount.exe [OPTION] [&lt;posixpath&gt;]
Unmount filesystems

  -A, --remove-all-mounts       remove all mounts
  -c, --remove-cygdrive-prefix  remove cygdrive prefix
  -h, --help                    output usage information and exit
  -s, --system                  remove system mount (default)
  -S, --remove-system-mounts    remove all system mounts
  -u, --user                    remove user mount
  -U, --remove-user-mounts      remove all user mounts
  -v, --version                 output version information and exit</PRE
><P
>The <B
CLASS="COMMAND"
>umount</B
> program removes mounts from the
mount table.  If you specify a POSIX path that corresponds to a
current mount point, <B
CLASS="COMMAND"
>umount</B
> will remove it from the
system registry area.  (Administrator priviledges are required).
The <VAR
CLASS="LITERAL"
>-u</VAR
> flag may be used to specify removing the mount 
from the user-specific registry area instead.</P
><P
>The <B
CLASS="COMMAND"
>umount</B
> utility may also be used to remove
all mounts of a particular type.  With the extended options it is
possible to remove all mounts (<VAR
CLASS="LITERAL"
>-A</VAR
>), all 
cygdrive automatically-mounted mounts (<VAR
CLASS="LITERAL"
>-c</VAR
>), all
mounts in the current user's registry area (<VAR
CLASS="LITERAL"
>-U</VAR
>), 
or all mounts in the system-wide registry area (<VAR
CLASS="LITERAL"
>-S</VAR
>) 
(with Administrator privileges).</P
><P
>See <A
HREF="using-utils.html#MOUNT"
>the Section called <I
>mount</I
></A
> for more information on the mount
table.</P
></DIV
></DIV
><DIV
CLASS="NAVFOOTER"
><HR
ALIGN="LEFT"
WIDTH="100%"><TABLE
SUMMARY="Footer navigation table"
WIDTH="100%"
BORDER="0"
CELLPADDING="0"
CELLSPACING="0"
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
><A
HREF="using-cygwinenv.html"
ACCESSKEY="P"
>Prev</A
></TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="cygwin-ug-net.html"
ACCESSKEY="H"
>Home</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
><A
HREF="using-effectively.html"
ACCESSKEY="N"
>Next</A
></TD
></TR
><TR
><TD
WIDTH="33%"
ALIGN="left"
VALIGN="top"
>The <VAR
CLASS="ENVAR"
>CYGWIN</VAR
> environment
variable</TD
><TD
WIDTH="34%"
ALIGN="center"
VALIGN="top"
><A
HREF="using.html"
ACCESSKEY="U"
>Up</A
></TD
><TD
WIDTH="33%"
ALIGN="right"
VALIGN="top"
>Using Cygwin effectively with Windows</TD
></TR
></TABLE
></DIV
></BODY
></HTML
>